[
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJXZWIgZGV2ZWxvcGVyICAgICAgTE1JQSByZXF1ZXN0ZWQiLCJjb21wYW55X25hbWUiOiJNaXh0byBMdGQuIiwiYWRkcmVzc19jaXR5IjoiTWlzc2lzc2F1Z2EsIE9OIiwiaHRpZG9jaWQiOiJ1WklRcEpiSmV1enZjMk9KQUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Web developer LMIA requested",
    "company_name": "Mixto Ltd.",
    "location": "Mississauga, ON",
    "description": "Education: Bachelor's degree. or equivalent experience. Tasks: Consult with clients to develop and document Website requirements. Design and integrate website related code. Write, modify, integrate and test software code. Communicate technical problems, processes and solutions. Assist in the collection and documentation of user's requirements. Conduct tests and perform security and quality controls. Write, modify, integrate and test software code for e-commerce and other Internet applications. Computer and technology knowledge: Development and operations (DevOps). Model-View-Controller (MVC). Windows Presentation Foundation (WPF). HTML. Internet. Desktop applications. JavaScript. CSS. SQL. .NET. ASP.NET. C#. MS Office. MS Windows. API. Angular.js. Bootstrap. GitHub. MS Visual Studio Code (VS Code). Postman. TypeScript. MS Excel. Equipment and machinery experience: Scanner. Area of work experience: Information technology (IT) service delivery. Area of specialization: Development of computer applications. Development. Screening questions: Are you authorized to work in Canada?. Experience: 7 months to less than 1 year. Other benefits: Free parking available. Other benefits. Team building opportunities.",
    "via": "Job Bank",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=uZIQpJbJeuzvc2OJAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_x3ETQrCMBBAYdz2CIIwa9FEBEF05UqURpcuS9IOaSRmYmYqPYnn9efx8ar3pNre0EGHL4yUscC_2pwOUPA5IAt2sIQzOWC0pe2BEhyJfMTpvhfJvNOaOSrPYiW0qqWHpoSORn0nx7813NuCOVrBZr1ZjSonP5-ZMApBLZ2CkMAE5i87eLuA6-UDFJMeS5kAAAA&shmds=v1_AdeF8Khv37eoetAUgrMT7hVpZfqBLBWZkaEFtXQTR_87q2y2-Q&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=uZIQpJbJeuzvc2OJAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTci4gUmVhY3QuanMgRGV2ZWxvcGVyIHdpdGggUEhQIGV4cCAoNzAlIFJlYWN0LmpzLzMwJSBQSFApIiwiY29tcGFueV9uYW1lIjoiVGVzdGluZ1hwZXJ0cyIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiJ0NWctRTlNakxzbU41T25zQUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Sr. React.js Developer with PHP exp (70% React.js/30% PHP)",
    "company_name": "TestingXperts",
    "location": "Toronto, ON",
    "description": "Title: Sr. React.js Developer with PHP exp (70% React.js/30% PHP) Location : Toronto, ON- Hybrid(3 days a week) Duration: 6+ months Job Description: • 10 + years of experience building and optimizing complicated user interfaces and extensive experience working within large-scale development environments. • Strong hands-on experience building/working large and complex client-facing web applications using ReactJS, HTML CSS, CMS/UI experience. • Developing and implementing highly responsive user interface components using react concepts. • Monitoring and improving front-end performance, documenting application changes, and developing updates. • Deep experience building beautiful, intuitive, and accessible customer facing applications. • Experience with frontend patterns, testing, debugging and performance. • Experience in PHP is preferred. • Ability to multi-task and prioritize in a fast-paced and dynamic work environment. • Solid communication and written skills: ability to explain complex technical issues to both technical and non-technical audiences.. • Strong problem-solving mindset",
    "via": "LinkedIn",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=t5g-E9MjLsmN5OnsAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_z2OMQrCQBBFsc0RxGIaQUV3gyKCtoJioVFT2IVNGLIJ686yM2hO5RmNjc2Hx3vFTz6D5HqPCm5oKlEtwx5f6ChghHcjFrJjBtgFmGzS8T_Sqx56M4UFnKgERhMrC-ThQFQ7HO6sSOCt1sxO1SxGmkpV9NTksaROt1Tybwq2JmJwRrBYrtNOBV_PRjmyNL5-9CeEofGQUyQvNIfL-Qv8FYlHsQAAAA&shmds=v1_AdeF8KgKG3aeKEEixAQ9Lq2e8mJ-ZkNzTJU2Oe8cKOQ8_lYifQ&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=t5g-E9MjLsmN5OnsAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "19 hours ago",
      "Contractor"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJJTlRFUk1FRElBVEUgV0VCIERFVkVMT1BFUiIsImNvbXBhbnlfbmFtZSI6IkFYSVMgRGF0YWJhc2UgTWFya2V0aW5nIiwiYWRkcmVzc19jaXR5IjoiTWlzc2lzc2F1Z2EsIE9OIiwiaHRpZG9jaWQiOiJHdHRNYVpmQllOS1o4ZWR5QUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "INTERMEDIATE WEB DEVELOPER",
    "company_name": "AXIS Database Marketing",
    "location": "Mississauga, ON",
    "description": "You, the ideal candidate, are outgoing and will show initiative, contributing intellectually to the improvement or streamlining of internal practices and procedures wherever you perceive an opportunity. You like to avoid quick-fix \"band-aid\" solutions, and small one-off development tasks, preferring instead to spend a little more time creating solid, carefully thought out leverageable solutions that will be re-used over and over again, building consistency and avoiding unnecessary development time over the long run. You have a strong affinity for HTML and CSS compliance, and accessibility on the web. You have education and experience coding ASP.Net and/or PHP, in conjunction with MS-SQL Database server. Must Have Skills • Very Good understanding of C# or PHP • Strong relational database knowledge and SQL • Hand coding in JavaScript, JQuery, JSON, Ajax, CSS, and HTML • Strong knowledge of at least one front-end framework like Angular, Backbone, React, Vu • Experience with API integration using SOAP/RESTful/JSON • Excellent knowledge of design patterns • Excellent understanding of OO programming and S.O.L.I.D. principles • Excellent problem solving / troubleshooting skills Areas of Responsibility • Analyze requirements and code modules • Build responsive web sites • Write unit tests General Qualifications/Assets • Preferred University degree or college diploma in Design, Communications, Computer Science or other related field • 2 years of experience in web development involving complex jQuery and SQL programming • Self-starter who is comfortable in a fast-paced, team-oriented environment • Highly motivated and detail oriented • Able to perform well under tight deadlines • You are able to commit to working standard business hours (0830 to 1700), but are flexible when needed. Please send your cover letter and resume to careers@axis-dbm.com. No attachments other than Microsoft Word or Acrobat PDF will be accepted. You may also copy and paste your resume and cover letter into the email body.",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=GttMaZfBYNKZ8edyAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEwQqCQBAAULr6CZ3mLOVW0KVOhksYqWGS3WRWlnXLdsTZwI_pYyt4vOAzC9ZpXskyk0kaVxJqeYBE3uS5uMgSlnAiBaxxbDsgB0ci0-v5vvN-4J0QzH1k2KO3bdTSS5DTiibxIMX_Gu5w1EOPXjeb7WqKBmfCML6nV0jQo0LWkOH41N46A9ZBZpl_8G1wAUX-BXXhBoyfAAAA&shmds=v1_AdeF8KjqEOeSaZbtXcBwgKv5iyS21-3mbymHGhBU22JCHUpkuw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=GttMaZfBYNKZ8edyAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJPbi1TaXRlIFdlYiBEZXZlbG9wZXIgOiBCdWlsZCAmIE9wdGltaXplIFdlYnNpdGVzIiwiY29tcGFueV9uYW1lIjoiVG9yb250byBJbmZvVGVjaCIsImFkZHJlc3NfY2l0eSI6Ik1pc3Npc3NhdWdhLCBPTiIsImh0aWRvY2lkIjoiR0VYTFlCTWxhSHdrSHozbEFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "On-Site Web Developer : Build & Optimize Websites",
    "company_name": "Toronto InfoTech",
    "location": "Mississauga, ON",
    "description": "A tech services company in Mississauga is seeking an Entry-level Website Developer to consult with clients and develop website requirements. The role involves designing code, optimizing content, and providing ongoing client support. Candidates should have a minimum of 1 year of experience in website development and possess strong technical communication skills. This is a full-time position located on-site with no remote option. #J-18808-Ljbffr",
    "via": "Talent.com",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=GEXLYBMlaHwkHz3lAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_x2MywrCMBAA8dpP8LQgeBDbiOBFbyL4AO3BgseS1jWNpNmQ3Urxm_xIqzDMaZjkM0oOuU-vVhBuWMEOX-goYIQ1bDvr7jCFPIht7fsf8BAypHCiChh1rBsgD3si43C8aUQCr5Vidplh0WLrrKZWkceKevWkin8qudERg9OC5XK16LPgzWxSUCQvBEf_oAKHsfVwtswDujN6DvnlCwKtStuvAAAA&shmds=v1_AdeF8KjTm7kYUdkJPBEDodRrw59-FHZoL9GcIkxBnt-eeKknQQ&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=GEXLYBMlaHwkHz3lAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "3 days ago",
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsLVN0YWNrIFdlYiBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJMaWdodHNwZWVkIENvbW1lcmNlIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6Ik55NlJWcG9YeS1UWUlHdHZBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Full-Stack Web Developer",
    "company_name": "Lightspeed Commerce",
    "location": "Toronto, ON",
    "description": "Hi there! Thanks for stopping by Are you actively looking for a new opportunity? Or just checking the market? Well… you might just be in the right place! We are looking for a Full-Stack Web Developer to join our Marketing team and help build, maintain, and evolve our marketing website and related applications. You will work across the stack — from creating intuitive, user-friendly front-end components to building and maintaining robust back-end systems. For this role, you should be located in Canada, and able to work within EST/EDT hours. We offer a choice of fully remote, partially remote or fully office-based work environments (in cities with local offices). What you will be doing • Develop and maintain scalable, maintainable, and secure full-stack applications and web components • Build, evolve, and implement new and existing UI/UX features in close collaboration with the design team • Develop and optimize backend logic, APIs, and integrations to support frontend functionality • Maintain and extend our WordPress ecosystem, including custom themes, plugins, and Gutenberg blocks • Ensure high standards of code quality through reviews, testing, and peer collaboration • Participate in technical discussions, architecture decisions, and feature planning • Stay current with both frontend and backend best practices and technologies What you need to bring: • Strong experience with backend development (PHP and Node.js, databases such as MySQL/Postgres) • Proficiency in JavaScript (ES6+), with experience in frameworks such as React • Strong knowledge of semantic HTML, CSS (Sass/LESS), and building responsive, accessible interfaces • Knowledge of SEO best practices in development to ensure code and content structure support overall search visibility • Experience working with RESTful APIs and integrations (building and consuming) Solid experience with CMS platforms (e.g., WordPress, Wordpress Multisite & Gutenberg) and customizing them when needed • Experience with version control (Git/GitHub) and modern development workflows • Solid understanding of cross-browser/platform compatibility issues and solutions • Ability to estimate, scope, and deliver features independently and as part of a team • Ability to contribute to clear documentation and actively share knowledge to support team collaboration and project continuity • A strong interest in great UX and performance-driven development • As a global company with employees and clients outside of Quebec, fluency in English as a working language is required for this position. Nice to have • Experience with testing (unit, integration, e2e with Cypress/Jest) • Knowledge of Google Tag Manager (GTM) and website analytics (GA4) • Familiarity with TypeScript • Experience with cloud hosting environments (e.g., AWS, GCP) and deployment workflows • Knowledge of security and performance best practices for web applications • Experience working in an Agile development environment • Leverage AI-assisted development tools thoughtfully to improve productivity, while ensuring code quality, security, and maintainability Now, what is in it for you? • Ability to do your job in a truly flexible environment; • Genuine career opportunities in a company that's creating new jobs everyday; • Work in a team big enough for growth but lean enough to make a real impact. …. And enjoy a range of benefits that will keep you happy, healthy and (not) hungry. • Lightspeed equity scheme (we are all owners). • Flexible paid time off and remote work policies. • Health insurance. • Contributions to your pension plan - RRSP. • Health and wellness benefit of $500 per year. • Paid leave and assistance for new parents. • Mental health online platform and conseling & coaching services. • Training opportunities to grow your skills and career. • Volunteer day. #LI-SS3 To all recruitment agencies: Lightspeed does not accept unsolicited agency resumes. If we have not directly engaged your company in writing to supply candidates for a specific vacancy, Lightspeed will not be responsible for any fees related to unsolicited resumes. Lightspeed is a proud equal opportunity employer and we are committed to creating an inclusive and barrier-free workplace. Lightspeed welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. Where to from here? Obviously, this has to be mutually beneficial: we want you to step into a role you love, and we want to offer you a place you're proud to come to every day. For a glimpse into our world check out our career page here. Lightspeed is building communities through commerce, and we need people from all backgrounds and lived experiences to do that. We were founded in 2005, in Montreal's gay village and our original members were all part of the LGBTQ+ community. The ethos of our business has been about inclusion from the very beginning, and we strive to provide a workplace where everyone belongs. Who we are: Powering the businesses that are the backbone of the global economy, Lightspeed's one-stop commerce platform helps merchants innovate to simplify, scale, and provide exceptional customer experiences. Our cloud commerce solution transforms and unifies online and physical operations, multichannel sales, expansion to new locations, global payments, financial solutions, and connection to supplier networks. Founded in Montréal, Canada in 2005, Lightspeed is dual-listed on the New York Stock Exchange (NYSE: LSPD) and Toronto Stock Exchange (TSX: LSPD). With teams across North America, Europe, and Asia Pacific, the company serves retail, hospitality, and golf businesses in over 100 countries. Lightspeed handles your information in accordance with our Applicant Privacy Statement.",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=Ny6RVpoXy-TYIGtvAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU6Ho9hGBBcdKwoiOig4liQeSTTJhdwp_Q6_WHzDa76TRu3fMbZX0fYFdzSwww9GKlihhSMZYNTVeqAMByIXcbr1IoU3SjHHzrFoCbazlBRlNDSqJxn-N7DXFUvUgsNqvRy7kt18dgrOCxfEB_SUElaLEDLcqFIWWsDl_AOoG1TslQAAAA&shmds=v1_AdeF8Kh1b5gfH3qJkyvy-BFaC6ue1PRQFk5sf_Nium8nnlSyRg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=Ny6RVpoXy-TYIGtvAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJXZWIgRGV2ZWxvcGVyOyBJbmRlcGVuZGVudCBDb250cmFjdG9ycyIsImNvbXBhbnlfbmFtZSI6Ildvb2RHcmVlbiIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiI5WnFMYUx1SU5SZWVVNzFyQUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Web Developer; Independent Contractors",
    "company_name": "WoodGreen",
    "location": "Toronto, ON",
    "description": "Position: Web Developer (Independent Contractors) Who We Are Wood Green is a team of diverse and innovative change makers working together to make a difference in our communities. A United Way Anchor Agency with a proven track record and an entrepreneurial mindset, we continuously seek to develop solutions to critical social needs while striving to become a Centre for Equity. Visit (Use the \"Apply for this Job\" box below). to learn more about who we are and to review our . We are committed to building an inclusive and diverse workforce, representative of the communities we serve. We encourage, and are pleased to consider, applications from Indigenous peoples, racialized persons/persons of colour, women/women identifying, persons with disabilities, 2 SLGBTQIA+ persons, and others who contribute towards promoting innovative ideas and solutions. Program Overview - Independent Contractors We are seeking skilled web developers to support the ongoing maintenance, updates, and optimization of our organizational website. The ideal candidate is detail-oriented, responsive, and experienced in working within established design systems and CMS platforms. Wood Green engages third-party vendors to support staff on projects on an as needed basis and eager to gather a list of pre-screened vendors to be added to our vendor list. Responsibilities: • Maintain and update content, pages, and features on Wood Green’s website (built on Word Press). • Troubleshoot technical issues and ensure website performance, accessibility, and security. • Implement design and functionality updates in collaboration with the Communications and IT teams. • Optimize pages for user experience, SEO, and mobile responsiveness. • Support the integration of digital tools, analytics, and plugins as needed. Qualifications: • Proven experience managing and developing Word Press websites (or similar CMS platforms). • Strong understanding of front-end development (HTML, CSS, JavaScript, PHP basics). • Familiarity with Google Analytics 4, SEO best practices, and accessibility standards (WCAG). • Excellent problem-solving skills and attention to detail. • Experience with nonprofit or public-sector websites is an asset. Portfolio required: Please include examples of websites you have developed or maintained, noting your specific contributions. Wood Green is an equal opportunity employer. We are committed to providing an inclusive and barrier-free selection process and work environment. If contacted in relation to an employment opportunity, please advise our People & Culture representatives at of the accommodation measures required. Information received relating to accommodation will be addressed confidentially. This public job posting uses AI-powered tools to screen, assess, or select applicants.",
    "via": "Learn4Good",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=9ZqLaLuINReeU71rAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCQAwAUFz7BeKUWbQngovFSaHooIvQsdxdQ1s5kyMJ0i_xe63LW1_xXRSnBgNc8IOJM0oFV-ow4wwZnJlMfDQWhS3cOICilzgAE9TMfcJVNZhlPTqnmspezdsYy8hvx4SBJ_fioH9aHbxgTt6w3R92U5mpXy8b5q4WRIKR4Mkyf7yBx_0Hhefir5kAAAA&shmds=v1_AdeF8KgYcfHJd1BK4uzjxffOPPkIoNZoF6cEyFy_Xjc67bx5jw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=9ZqLaLuINReeU71rAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "17 hours ago",
      "Contractor"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJXZWIgZGV2ZWxvcGVyL0Rlc2lnbmVyIiwiY29tcGFueV9uYW1lIjoiQS5SLiBFbnZpcm9ubWVudGFsIFNvbHV0aW9ucyBJbmMuIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6Im1iYjBWdHZ5bW1WWFFtZlhBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Web developer/Designer",
    "company_name": "A.R. Environmental Solutions Inc.",
    "location": "Toronto, ON",
    "description": "No. of position: 1Key responsibilities:- Design and develop website layouts, contributing creative input to a variety of digital projects.- Oversee the management and daily updates of all company websites to ensure content remains current and relevant.- Perform regular maintenance and enhancements to existing sites, addressing any technical issues as they arise.- Utilize scripting and authoring languages, management systems, content development tools, and digital media applications to support website functionality and user experience.- Edit, write, and design website content; coordinate and guide team members responsible for producing digital materials.- Assess user needs by conducting technical requirement analyses to inform website features and improvements.- Leverage social media platforms such as Facebook, Twitter, and WordPress to share information, foster engagement, and promote the organization’s website and initiatives. -FinalRequirements for Web Developer Position- Bachelor’s degree (or current enrolment) in Web Development, Computer Science, or a related discipline, or equivalent professional experience.- Demonstrated web design expertise with a compelling portfolio showcasing completed projects.- Advanced proficiency in WordPress site management and content updates.- Strong ability to communicate, collaborate, and present creative concepts to enhance website design and functionality.- Proficient in using web development software, scripting languages, and digital content management tools.- Exceptional written and verbal communication abilities.- Capable of working independently with minimal supervision.- Collaborative team player committed to shared goals and project success.- Resilient and able to excel in a dynamic, fast-paced environment.- Solid understanding of programming languages and technical terminology relevant to web development.- Skilled at developing innovative ideas and processes, and expressing them clearly to stakeholders.- Proven problem-solving ability for complex technical challenges.Location:Toronto, ON, Canada (Hybrid)Weekly working hours: Flexible.We thank all applicants for their interest. However, only those selected for an interview will be contacted.(Apply below)",
    "via": "Startup Job Board - University Of Toronto",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=mbb0VtvymmVXQmfXAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXJsQrCMBAAUFz7CU43iyZFcNFJUEQHBRUcS1KPNJLehdxZ-jV-q7q85VWfSbV4oIcnDpg4Y7E7lBgICyzgxB4EXWk7YIIDc0g43XSqWdbWiiQTRJ3G1rTcWyb0PNoXe_nTSOcK5uQUm-WqHk2mMKu35mpgT0MsTD2SugQ3Tm-NTAJHag1Egjv_VnkOl_MXG6Pxh6EAAAA&shmds=v1_AdeF8KjBGXM_ryy1Z9RRXM7jgX29szuRB0uaORroHNunCayQHA&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=mbb0VtvymmVXQmfXAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "8 days ago",
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJJTlRFUk1FRElBVEUgV0VCIERFVkVMT1BFUiIsImNvbXBhbnlfbmFtZSI6IlR1bmRyYSBUYWxlbnQgQ29tbXVuaXR5IiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6InRkd2t0cFk0eXRIQUVsWUVBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "INTERMEDIATE WEB DEVELOPER",
    "company_name": "Tundra Talent Community",
    "location": "Toronto, ON",
    "description": "Intermediate Developer (JAVA/Angular Minimum 4 plus years experience The Enterprise Applications and Solutions Integration department within the Chief Information Officer '' s (CIO) Division is a central department responsible for all matters pertaining to the development, maintenance and effectiveness of the core administrative management and student systems. Included within these responsibilities are all central SAP systems, such as Financial Services, Human Resources, Research Administration and Procurement; the central U of T Student System; approximately 40 related vendor and specialized web applications, as well as central Business Intelligence and Document Management applications. Your opportunity: Under the general supervision of the Student Information Systems {SIS) Development Manager, you will be part of a dynamic, collaborative and an innovative development team, responsible for producing quality code as it pertains to application development. You will also be expected to contribute to, and participate regularly in the Software Development Life Cycle methodology that the team uses, for implementation of enterprise wide solutions, to its divisional clients across the university (Tri-Campus). Your responsibilities will include: - Analyzing, recommending, and designing highly complex software architecture - Developing and updating architectural framework for highly complex and confidential university-wide applications - Writing complex technical code - Evaluating programming code to ensure it has validity, compatibility, and that it meets appropriate standards - Commenting on programming code for the purposes of standardization and consistency - Analyzing, recommending and designing technical solutions for highly complex IT problems Qualifications - Essential Qualifications: - Bachelor''s degree in computer science or an acceptable equivalent combination of education and experience. - Minimum four plus years relevant experience in applications development: JAVA and Angular experience is required. - Demonstrated ability to lead technical teams in highly complex projects. - Proficiency building J2EE web applications: Java EE Web Services, Java Servlets, JSP, Struts, Spring MVC, JSTL, Junit, JavaScript, Angular , JPNHibernate, HTMLS. - Extensive knowledge of CSS and JS methods for providing Performant Visual Effects and AODA. - Thorough understanding of the responsibilities of the platform, database, AP[, caching layer, proxies, and other web services used in systems. - Demonstrated ability to work within tight timelines; ability to problem-solve technical issues, exercise good judgment, ability to work effectively independently as part of a team. - Excellent client service skills, ability to communicate effectively and accurately both orally and in writing, including the ability to communicate technical concepts to persons with limited technical backgrounds. To be successful in this role you will be: - Adaptable - Goal oriented - Motivated self-learner - Possess a positive attitude Job 70426",
    "via": "Jobrapido.com",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=tdwktpY4ytHAElYEAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43OYg2KrjopDZIRVspQceS1tBWkruSXKH-iZ8rvuFF30m0TjMli5tM0oOS8JRHSORDXvO7LGAJF6ogGO3rFgjhTNRYM923zH3YCRGCjZvAmrs6rskJQlPRKN5UhX9laLU3vdVsys12NcY9NvOZGvDlNShtDTKcyLkBO_5Ah6DIEzItIM9-3-SlqpsAAAA&shmds=v1_AdeF8KipiGg8pge7TuEaT1XvRK9fSV5QX9EgxXrQp4BPv6N4Ng&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=tdwktpY4ytHAElYEAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "4 days ago",
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJXZWIgRGV2ZWxvcG1lbnQgU3BlY2lhbGlzdCIsImNvbXBhbnlfbmFtZSI6ImVsaXRlcmVjcnVpdHNodWIiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoibGkwYldYTWxNWndTVmdTckFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Web Development Specialist",
    "company_name": "eliterecruitshub",
    "location": "Toronto, ON",
    "description": "eliterecruitshub Overview: As a Web Developer, you will be responsible for designing, coding, and modifying websites, from layout to function and according to a client's specifications. You will strive to create visually appealing sites that feature user-friendly design and clear navigation. Your role will involve collaborating with various stakeholders including clients, designers, and other developers to ensure successful project completion. Responsibilities: Designing and implementing website layouts based on client specifications and user experience principles. Developing server-side and client-side code for web-based applications. Integrating graphics, audio, and video components into the website for enhanced user experience. Writing clean, efficient, and well-documented code using best software development practices. Collaborating with graphic designers to ensure visually appealing site design. Testing website functionality, identifying technical problems, and debugging issues. Conducting ongoing website maintenance, including monitoring performance, optimizing loading speeds, and updating content. Staying abreast of new trends and technologies in web development and recommending relevant updates and improvements. Collaborating with cross-functional teams, including designers and marketers, to ensure the successful execution of digital projects. Providing technical support and troubleshooting for website-related issues. Requirements: Bachelor's degree in Computer Science, Web Development, or a related field (or equivalent work experience). Proven experience as a web developer, with a strong portfolio showcasing previous work. Proficiency in front-end technologies such as HTML, CSS, JavaScript, and jQuery. Experience with responsive design techniques and frameworks (e.g., Bootstrap). Familiarity with server-side languages such as PHP, Python, or Ruby on Rails. Experience with database systems (e.g., MySQL, MongoDB) and proficiency in SQL. Solid understanding of web development best practices, including SEO principles. Experience with version control systems (e.g., Git). Strong problem-solving skills and attention to detail. Excellent communication and teamwork abilities. Ability to work independently and manage multiple projects simultaneously. Knowledge of web analytics tools (e.g., Google Analytics) is a plus. Preferred Qualifications: Experience with content management systems (e.g., WordPress, Drupal). Knowledge of UX/UI design principles. Familiarity with graphic design tools such as Adobe Photoshop or Illustrator. Understanding of accessibility standards and best practices. This job description is intended to convey information essential to understanding the scope of the Web Developer position and is not an exhaustive list of skills, efforts, duties, responsibilities, or working conditions associated with it. Duties, responsibilities, and activities may change or new ones may be assigned at any time with or without notice. Sector: Employment and Placement Agencies/Recruiting Role: Administration / Payroll Will manage other people: Yes Job type: Permanent job Career level: Employee",
    "via": "Jooble",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=li0bWXMlMZwSVgSrAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAGYFz7CC7eLNqo4KKrIDjooOBYkvDTpKS5kLtKX8M3Fr_ha76LZv-Gows-SFxGZKVngY82RVHa0o0dCWz1gTjTlblPWJ6DapGTMSKp7UWtRt96Hg1nOJ7NwE7-dRJsRUlW0R2Ou7ktuV-vkKKiwtcpqoTJUcz04spZeUOP-w8C5aa0lAAAAA&shmds=v1_AdeF8KjOPk_sk9-HZiBvCGwCYZGaFjbZ9QWBpY5s0LUEtbseWQ&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=li0bWXMlMZwSVgSrAAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "3 days ago",
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgV2ViIERldmVsb3BlciAtIENoZWlsIENhbmFkYSIsImNvbXBhbnlfbmFtZSI6IkNoZWlsIERhbGxhcyIsImFkZHJlc3NfY2l0eSI6Ik1pc3Npc3NhdWdhLCBPTiIsImh0aWRvY2lkIjoiYmd4VC1mOThBMUhPMWhUX0FBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Junior Web Developer - Cheil Canada",
    "company_name": "Cheil Dallas",
    "location": "Mississauga, ON",
    "description": "Cheil Canada Who are we? Cheil Canada is a full-service agency based out of Mississauga, Ontario and part of the Cheil Worldwide network, offering a variety of marketing & advertising solutions. We are a full-service data-driven company, rooted firmly in customer experience and performance. We work across the entire customer journey, creating connections that result in relevant and meaningful personalization through: • Data & Insight • Retail Marketing & Shopper Marketing • Digital and Social Marketing • eCommerce & eRetailer Marketing Job Summary We are looking for a motivated and detail-oriented Junior Web Publisher to join our dynamic team. In this role, you will be responsible for publishing, updating, and maintaining content across our web platforms. The ideal candidate has a strong understanding of web publishing processes and front-end technologies, and experience working with content management systems (CMS). This is an excellent opportunity for someone with 1–3 years of experience looking to further develop their skills in a collaborative environment. Key Responsibilities: Publish, update, and maintain content across web platforms using a CMS. Collaborate with designers, developers, and other teams to ensure content is displayed accurately and optimized for user experience. Troubleshoot and resolve content-related issues on the website. Ensure website consistency in terms of layout, style, and branding. Test and validate content updates for various browsers and devices. Adhere to SEO best practices when publishing content. Assist in monitoring website performance and work on performance improvements. Stay up to date with web publishing trends and emerging technologies. Required Skills & Qualifications: 1–3 years of experience in web publishing, web content management, or a similar role. Proficiency in HTML, CSS, and JavaScript. Experience with content management systems (e.g., WordPress, Drupal, Joomla, or any proprietary CMS). Strong attention to detail and the ability to manage multiple tasks and deadlines. Basic understanding of SEO and web analytics tools (e.g., Google Analytics). Good communication skills and a team player. Eagerness to learn and adapt to new technologies. Preferred Qualifications: Familiarity with front-end frameworks like Bootstrap or similar. Experience working with version control systems (e.g., Git). Basic design skills or experience with graphic editing tools (e.g., Photoshop, Figma, etc.). Cheil Canada truly believes in diversity and hires talent with a wide range of knowledge, skills and professional background. As part of Cheil Worldwide, Cheil Canada plays its part in one of the world’s biggest agency networks–comprising of 54 offices and nine affiliates in 46 countries globally. Cheil is proud to be an Equal Opportunity Employer committed to diversity and inclusion. All qualified candidates will receive equal consideration without regard to race, creed, colour, religion, gender, sexual orientation, gender identity/expression, national origin, age, marital status, disability, or any other characteristic protected by law. We believe that diversity and inclusion is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Web+Developer&htidocid=bgxT-f98A1HO1hT_AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_yWNsQrCMBBAce0nuHizaCOCSx1bEArq6CiXeiSRMxdyqfRb_ForwuPBm171WVRNP8YgGW5koaM3sSTKsIXWU2BoMeID5-zFghLmwYNEOIk4puXRl5K0MUaVa6cFSxjqQV5GIlmZzFOs_nRXj5kSY6H7_rCb6hTdevU_dMiMCiHCOajO4OhwA9fLFxLrjbKdAAAA&shmds=v1_AdeF8Kg6nPh9GQSczFWs1JJ8Hki4TAjQpmVgdwLnjzPUl_GCHQ&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=bgxT-f98A1HO1hT_AAAAAA%3D%3D&htiq=Web+Developer",
    "extensions": [
      "Full-time"
    ],
    "search_keyword": "Web Developer",
    "scrape_date": "2025-12-04T12:05:04.413371"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsIFN0YWNrIERldmVsb3BlciAoSHlicmlkKSIsImNvbXBhbnlfbmFtZSI6IkFuYW50IFNhdHlhIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6InhTOW5PTVNhVkRBa19vdGdBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Full Stack Developer (Hybrid)",
    "company_name": "Anant Satya",
    "location": "Toronto, ON",
    "description": "Job Title- Full Stack Developer Location- Toronto, Canada, Hybrid Front-end Development (ReactJS): (50% Heavy experience) • Building modern and responsive user interfaces with ReactJS, including component-based architecture and state management. • Utilizing JavaScript, HTML, and CSS for front-end development. • Integrating with back-end APIs using tools like Axios or Fetch API. • Ensuring cross-browser compatibility and optimizing for performance Back-end Development (Java): (50% Experience) • Designing and developing robust, scalable, and secure RESTful APIs and microservices using Java frameworks like Spring Boot. • Working with databases (SQL and NoSQL) and ORM tools (e.g., Hibernate, Spring Data JPA) for data persistence. • Implementing authentication and authorization mechanisms (e.g., Spring Security, JWT). • Understanding and applying software design patterns and best practices. Job Type: Fixed term contract Contract length: 12 months Pay: From $50.00 per hour Application question(s): • What is your visa status Work Location: Hybrid remote in Toronto, ON M5J 1E3",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=xS9nOMSaVDAk_otgAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CZ1uVNFGRBedBFFx0KHu5RKPphrvQnJK-xX-sviGV3xHxerwDgFqRfeEPX0oSKQE49NgU3efwBzOYiETJudBGI4ibaBy61Vj3hiTc6jarKidq5y8jDBZ6c1DbP7XZI-JYkClZrle9FXkdlruGFmhRh0QOoabJGGVGVwvP_T24DCSAAAA&shmds=v1_AdeF8KjHZVWw1Xp57DnWk0Yi5-s888E2AsQpNy9OnfoXkcCRcw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=xS9nOMSaVDAk_otgAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "24 hours ago",
      "$50 an hour",
      "Contractor"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIEZ1bGwgU3RhY2siLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCBDYW5hZGEiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoiUFZkazlnYzJadkk5VnMtRkFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Senior Software Developer Full Stack",
    "company_name": "Randstad Canada",
    "location": "Toronto, ON",
    "description": "Do you have 3+ years experience Azure APIM, Azure Service Bus, Azure Containers Apps/Jobs, Azure DevOps? Do you have ﻿8+ years experience in ASP.NET Core / Minimal API’s / LINQ (.NET 8+)? If so, this would be a great opportunity for you! Our client is looking for a Senior Software Developer Full Stack for a 6 contract in Toronto. This is an onsite role. Advantages • Earn a competitive rate within the industry. • Location : 5 days onsite. Responsibilities • Provides subject matter expertise and identifies and encourages areas for improvement. • Delivers the best user experiences possible and is jointly accountable for the quality of the products and services that they deliver for the customers. • Provides mentoring to specific Software Development I and potentially Software Engineer I to discuss specific engineering practices and problems that may arise during day-to-day work. Provides context and perspective to the project Software Development and Software Engineers regarding engineering design decisions as well as business requirements that influence implementation details. • Coaches and mentors project team members by elevating their scope of knowledge and breadth in aspects of design and development best practices. • Shares new trends and techniques with project team members via various forums, like chapters. • Develops supporting and configuration documentation, or guides project team members in delivering technical documentation. • Provides input and expertise to QA team on application testing. • Provides work estimates for their own development tasks and verifies work estimates of others. • Performs code reviews and walkthroughs of system design and developed code. • Participates in and contributes to requirement definition working sessions, specification development and solution design. • Develops applications to specifications within the required timeframe and budget. • Identifies risks and escalates to project/product leadership on a timely basis. • Pinpoints strengths and weaknesses of various design alternatives and selects or recommends appropriate solutions. • Proactively suggests alternative methods or resources for getting work done when obstacles arise. • Reviews systems for completion and system performance objectives. • Recommends changes across the project team's engineering practices as well as external team practices to improve the team's cycle time as well as lead time for the team's product backlog. • Leads the change in the adoption of new engineering practices across the project team. • Independently engages and actively participates in project team discussion with product management teams to recommend product features and changes to product features to improve the user experience, operation and maintainability of the product. • Participates in development of engineering plans and systems specifications with Lead Engineers. • Collaborates with project team members to ensure alignment of practices, patterns, and solutions. • Ensures work aligns to broader roadmaps and systems strategies. • Stays abreast of evolving technology, architecture, and design, patterns, practices, and platforms. • Makes decisions and proposes solutions where results have substantial impact across the organization requiring sophisticated solutions and long-term correction. Occasionally has cross-portfolio and external stakeholder interactions. Qualifications Must Haves: • 8+ years experience React 18/ HTML 5 / CSS. • ﻿8+ years experience ASP.NET Core / Minimal API’s / LINQ (.NET 8+). • 3+ years experience Azure APIM, Azure Service Bus, Azure Containers Apps/Jobs, Azure DevOps. • 3+ years experience SQL Server / REDIS Cache. Nice to Have: • Microservices/Docker. Summary If you are interested in the Senior Software Developer Full Stack role in Toronto, please apply online at www.randstad.ca. Qualified candidates will be contacted. Randstad Canada is committed to fostering a workforce reflective of all peoples of Canada. As a result, we are committed to developing and implementing strategies to increase the equity, diversity and inclusion within the workplace by examining our internal policies, practices, and systems throughout the entire lifecycle of our workforce, including its recruitment, retention and advancement for all employees. In addition to our deep commitment to respecting human rights, we are dedicated to positive actions to affect change to ensure everyone has full participation in the workforce free from any barriers, systemic or otherwise, especially equity-seeking groups who are usually underrepresented in Canada's workforce, including those who identify as women or non-binary/gender non-conforming; Indigenous or Aboriginal Peoples; persons with disabilities (visible or invisible) and; members of visible minorities, racialized groups and the LGBTQ2+ community. Randstad Canada is committed to creating and maintaining an inclusive and accessible workplace for all its candidates and employees by supporting their accessibility and accommodation needs throughout the employment lifecycle. We ask that all job applications please identify any accommodation requirements by sending an email to accessibility@randstad.ca to ensure their ability to fully participate in the interview process.",
    "via": "Randstad",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=PVdk9gc2ZvI9Vs-FAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXMwQ7BQBCA4bj2ERxkzkJXJC4cCYkDibo30-1oy5rZ7Az6LJ5WXf7b92ffUbYpiDtJUMjNPpgIdvSmIJES7F8hQGHoHzCHo1SghMm3IAwHkSbQeNOaRV07pxryRg2t87mXpxOmSnp3l0r_KbUd1jGgUblcLfo8cjOdXJDrwdSwRcYaoWO4ShI2mcH59AN44TJVnQAAAA&shmds=v1_AdeF8KhtuZkzHjEHeLJ12ENaey3hMcJFdqR7PPeCWArf7-jLKg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=PVdk9gc2ZvI9Vs-FAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "2 days ago",
      "Contractor"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnVsbHN0YWNrIERldmVsb3BlciAoVHlwZXNjcmlwdC9Ob2RlSlMpIiwiY29tcGFueV9uYW1lIjoiUmVzb25haXRlIiwiYWRkcmVzc19jaXR5IjoiTWFya2hhbSwgT04iLCJodGlkb2NpZCI6ImplY29tMzdxd1JHVG9QUklBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Senior Fullstack Developer (Typescript/NodeJS)",
    "company_name": "Resonaite",
    "location": "Markham, ON",
    "description": "Our client is seeking a Senior Developer on a contract basis to work on their modernization program. The ideal candidate has expertise in Typescript/Node.js Location: Hybrid Markham 4d/week Duration: 6 months Responsibilities • Design, develop, and maintain fullstack applications using TypeScript, Node.js, and React. • Build scalable REST APIs, backend services, and integrations aligned with enterprise standards. • Participate in sprint planning, backlog refinement, architecture discussions, and technical design sessions. • Write clean, testable, well-structured code with unit, integration, and end-to-end test coverage. • Conduct code reviews, provide constructive feedback, and help raise the overall code quality. • Work closely with product managers, UX designers, and cross-functional teams to deliver customer-focused features. • Troubleshoot production issues, optimize application performance, and improve reliability. • Contribute to CI/CD pipelines, automation, and DevOps best practices. • Participate in code reviews and help elevate engineering standards within the team. • Document technical designs, workflows, and implementation details. Requirements: • 5+ years of hands-on software development experience building fullstack applications. • Strong proficiency in TypeScript and Node.js for backend development (Express, NestJS, or similar). • Experience with React, Next.js, or another modern front-end framework. • Experience designing and consuming REST APIs, and working with microservice or modular architectures. • Strong understanding of SQL and/or NoSQL databases and data modeling (PostgreSQL, MySQL, MongoDB, etc.). • Practical experience with Azure or AWS (Azure preferred), including deployments, monitoring, and cloud-based services. • Proficiency with Docker, containerized development, and modern CI/CD pipelines (Azure DevOps, GitHub Actions, etc.). • Familiarity with automated testing frameworks (Jest, Mocha, Playwright, Cypress). • Strong understanding of secure coding practices, authentication, and authorization (JWT, OAuth2, SSO). • Excellent problem-solving skills and the ability to break down complex requirements.",
    "via": "LinkedIn",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=jecom37qwRGToPRIAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXMvQrCMBAAYFz7BOJ0o4o2Irjo6g8UrGDdyzUeTWyaC7ko9WV8VnX5xi_7jLJDRd5yhOPTOUmoO9jTixwHijC9vQOJjjYkVfKdimoGSyi4ASGM2gB7ODG3jiY7k1KQrVIiLm9_UbI619wr9tTwoB7cyJ9aDEYKDhPV681qyINv5-MrCXu0icB6OGPsDPYLuJRfMatuaaEAAAA&shmds=v1_AdeF8KgQvfgRTFco0vUeAjtTX4_wI39G62hGeD9Jnplofp5wQA&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=jecom37qwRGToPRIAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "17 hours ago",
      "Contractor"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIEZ1bGwgU3RhY2siLCJjb21wYW55X25hbWUiOiJSYW5kc3RhZCIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiJsSXBIbGVnZVc5NTNSMGxmQUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Senior Software Developer Full Stack",
    "company_name": "Randstad",
    "location": "Toronto, ON",
    "description": "Do you have 3+ years experience Azure APIM, Azure Service Bus, Azure Containers Apps/Jobs, Azure DevOps? Do you have ﻿8+ years experience in ASP.NET Core / Minimal API’s / LINQ (.NET 8+)? If so, this would be a great opportunity for you! Our client is looking for a Senior Software Developer Full Stack for a 6 contract in Toronto. This is an onsite role. Advantages • Earn a competitive rate within the industry. • Location : 5 days onsite. Responsibilities • Provides subject matter expertise and identifies and encourages areas for improvement. • Delivers the best user experiences possible and is jointly accountable for the quality of the products and services that they deliver for the customers. • Provides mentoring to specific Software Development I and potentially Software Engineer I to discuss specific engineering practices and problems that may arise during day-to-day work. Provides context and perspective to the project Software Development and Software Engineers regarding engineering design decisions as well as business requirements that influence implementation details. • Coaches and mentors project team members by elevating their scope of knowledge and breadth in aspects of design and development best practices. • Shares new trends and techniques with project team members via various forums, like chapters. • Develops supporting and configuration documentation, or guides project team members in delivering technical documentation. • Provides input and expertise to QA team on application testing. • Provides work estimates for their own development tasks and verifies work estimates of others. • Performs code reviews and walkthroughs of system design and developed code. • Participates in and contributes to requirement definition working sessions, specification development and solution design. • Develops applications to specifications within the required timeframe and budget. • Identifies risks and escalates to project/product leadership on a timely basis. • Pinpoints strengths and weaknesses of various design alternatives and selects or recommends appropriate solutions. • Proactively suggests alternative methods or resources for getting work done when obstacles arise. • Reviews systems for completion and system performance objectives. • Recommends changes across the project team's engineering practices as well as external team practices to improve the team's cycle time as well as lead time for the team's product backlog. • Leads the change in the adoption of new engineering practices across the project team. • Independently engages and actively participates in project team discussion with product management teams to recommend product features and changes to product features to improve the user experience, operation and maintainability of the product. • Participates in development of engineering plans and systems specifications with Lead Engineers. • Collaborates with project team members to ensure alignment of practices, patterns, and solutions. • Ensures work aligns to broader roadmaps and systems strategies. • Stays abreast of evolving technology, architecture, and design, patterns, practices, and platforms. • Makes decisions and proposes solutions where results have substantial impact across the organization requiring sophisticated solutions and long-term correction. Occasionally has cross-portfolio and external stakeholder interactions. Qualifications Must Haves: • 8+ years experience React 18/ HTML 5 / CSS. • ﻿8+ years experience ASP.NET Core / Minimal API’s / LINQ (.NET 8+). • 3+ years experience Azure APIM, Azure Service Bus, Azure Containers Apps/Jobs, Azure DevOps. • 3+ years experience SQL Server / REDIS Cache. Nice to Have: • Microservices/Docker. Summary If you are interested in the Senior Software Developer Full Stack role in Toronto, please apply online at www.randstad.ca. Qualified candidates will be contacted. Randstad Canada is committed to fostering a workforce reflective of all peoples of Canada. As a result, we are committed to developing and implementing strategies to increase the equity, diversity and inclusion within the workplace by examining our internal policies, practices, and systems throughout the entire lifecycle of our workforce, including its recruitment, retention and advancement for all employees. In addition to our deep commitment to respecting human rights, we are dedicated to positive actions to affect change to ensure everyone has full participation in the workforce free from any barriers, systemic or otherwise, especially equity-seeking groups who are usually underrepresented in Canada's workforce, including those who identify as women or non-binary/gender non-conforming; Indigenous or Aboriginal Peoples; persons with disabilities (visible or invisible) and; members of visible minorities, racialized groups and the LGBTQ2+ community. Randstad Canada is committed to creating and maintaining an inclusive and accessible workplace for all its candidates and employees by supporting their accessibility and accommodation needs throughout the employment lifecycle. We ask that all job applications please identify any accommodation requirements by sending an email to accessibility@randstad.ca to ensure their ability to fully participate in the interview process.",
    "via": "Randstad",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=lIpHlegeW953R0lfAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXMMQrCQBBGYWxzAcFqatGsCDamFQULBWMfNpsxia77Lzuj5h5e2Ni87nvZd5IVJYceiUrc9GMT047f7BE50f7lPZVq3YOWdERNwja5jhDoALSeZ0WnGmVrjIjPW1GrvcsdngaBawzmjlr-qaQb19Fb5Wq9WQ15DO18erGhGU1DfaArEoJiQefTD3jY4WiWAAAA&shmds=v1_AdeF8Kh3Fy5xP_FESkc38aUKcgvxW8hzWK2bZavb6xufhDYuOA&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=lIpHlegeW953R0lfAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "2 days ago",
      "Contractor"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJMYXJhdmVsIEZ1bGwgU3RhY2sgRGV2ZWxvcGVyIC0gNm1vbnRoIGZpeGVkIHRlcm0iLCJjb21wYW55X25hbWUiOiJUaGUgVHVybiBMYWIgSW5jLiIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiIteW9NMU9CR1c3T0pDWUE0QUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Laravel Full Stack Developer - 6month fixed term",
    "company_name": "The Turn Lab Inc.",
    "location": "Toronto, ON",
    "description": "We are looking for aLaravel Full Stack Developerto join our team!We are looking for an individual who can manage the software development life cycle from conception to deployment. A collaborator who can work as part of a cross-functional team to design and develop software solutions that meet the needs of our clients. A quality driven individual when it comes to writing clean and functional code and has an “eye” for detail when testing and fixing coding issues. Someone who has the desire and ability to grow professionally in a highly flexible and fast-moving environment.Who is the theturnlab?One part consultancy. One part ad agency. One part technology company.We are a marketing and technology lab, leveraging curiosity, data-driven insights, and 25 years of market expertise to pinpoint and solve our client's business challenges. We are a team of self-starting, problem-solvers. We are ambitious, thick-skinned, fast-paced, and constantly looking to add curious, passionate, and solution-focused individuals to our team. Additionally, we are proud to be an equal opportunity employer and are committed to creating a diverse and inclusive workplace.If you can think on your feet, get excited about troubleshooting, approach your craft with pride and enthusiasm, and want to work for a purpose-driven organization that’s a Certified B Corporation and runs 100% carbon neutral, then WE might just be the place for YOU!What is a day in a life of a Laravel Full Stack Developer at theturnlab?You will work with our other internal departments to develop a deep understanding of our clients’ application needs. Through your solid planning and communication skills, you will take ownership of the project’s tasks, timelines and communication. Your days will consist of you developing robust and user-friendly front-end applications and architecture. In summary, you will:assist in gathering requirements and project specificationscreate site layout/user interface from provided design concepts using standard HTML/CSS/JavaScript practicesCreate placement and layout of website pages provided by the design teamproduce fault-tolerant, robust, and maintainable codedesign and develop relational database schemas and serverswrite and maintain technical documentationperform routine daily maintenance of existing sites and applicationsidentify and solve software issues experienced by clientsconduct software testingtroubleshoot and upgrade softwarecreate security and data protection settingsWhat value will you bring to our team?You will have a post-secondary education in a related field coupled withfive plus years of experience in a similar position. You will bring with youa solid understanding of web application development processes from the layout/user interface to relational database structures. You will have demonstrated experience as a collaborator and team player with solid planning, communication and writing skills. Furthermore,you will have:5+ years of software development experience using theLaravelframework5+ years of experience with relational database management systemsexperience with web service API protocols and formats such as JSON or XMLunderstanding of the search engine optimization conceptsthe ability to communicate directly with peers, managers, and clients when requiredstrong organizational skills to manage multiple timelines and complete tasks quickly within the constraints of clients’ timelines and budgetsawareness of and pride in 100% client satisfactionWho are we?We’re ambitious. We defy the current. We challenge our clients, each other, and anyone who says that a challenge isn’t fun. We value diverse and broad talents, ideas, and approaches.We embrace diversity, inclusion, and equity. We value differences and uniqueness. We respect and encourage everyone to share their experiences, thoughts, and views – everyone has a voice at the turn lab.We welcome and encourage applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.Visit theturnlab.com to learn more about us!",
    "via": "Eluta.ca",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=-yoM1OBGW7OJCYA4AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNsQ7CIBRG4bj2EZz-2SgYEx10NTaaRge7N4DXUqVcAtT0kXxM63KGbznFd1aUlYrqQw6nwTncszJvHGkCDhSxwq5nny2e3UgPZIr9ZBfWSKSisWCPkrl1ND_YnEPaS5mSE23KKndGGO4le9I8yhfr9E-TrIoUnMrUbLbrUQTfLlBbQj1Ej0ppnL0R6DxqjtOcl7hdf1ucdEarAAAA&shmds=v1_AdeF8Kh1_hyAnbfJxXW-Bfk-uaMTQOb_RdXstennOn817pPDXw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=-yoM1OBGW7OJCYA4AAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "1 day ago",
      "Full-time"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJFbnRyeSBGdWxsLVN0YWNrIEphdmEgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiTm9ydGhlcm4gQ29tbWVyY2UiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoieC1BLXBlb2ZuMUE4TWdIeUFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Entry Full-Stack Java Developer",
    "company_name": "Northern Commerce",
    "location": "Toronto, ON",
    "description": "About Northern Headquartered in London, Ontario, Canada, Northern is an integrated digital solutions agency specializing in helping leading commercial and public service brands navigate digital change. By leveraging our expertise and deep understanding of our clients’ businesses, we collaborate to design, create, and enable tailored digital experiences that drive growth. Since our founding in 2015, Northern has grown into a team of 200+ digital experts, receiving multiple recognitions in employee engagement from Great Place to Work® Canada, including Best Workplaces™ for Inclusion, Women, Mental Health, Hybrid Work, and more. What We’re Looking For As an Entry Full-Stack Java Developer at Northern, you will learn to build and maintain digital marketing solutions for our clients under the guidance of our senior development team. As a member of our Experience development team, you will work alongside experienced developers and technical leads to grow your skills in developing dynamic, responsive and efficient web applications through hands-on experience with front-end and back-end technologies. Full-time remote is available nationally. Our Connected Workplace Program gives you the option to choose a remote, hybrid or in-office workspace! (within Canada) Benefits of Becoming a Northerner In exchange for your talent and expertise, Northern is committed to providing: • Benefits plan, including a Health Spending Account • Wellness Program & LifeWorks EAP • Fitness Reimbursement Program • Vet Care Program • RRSP Matching • Profit-Sharing Performance Bonuses • Endless Professional Growth Opportunities • Delicious Meals & Company Social Events • Free Onsite Parking • Referral Bonus Program • Flexible work environment - so you can work where & when you work best • Allowance to help set up home office Just to name a few!... What You'll Be Doing • Participate in cross-functional project teams through sprint planning, daily stand-ups, and sprint retrospectives, learning development best practices while contributing to team deliverables. • Work with senior developers and stakeholders to understand requirements and implement technical solutions under guidance and code review. • Develop features and components that meet business requirements while learning best practices for Experience development through mentorship. • Create and maintain documentation for your work, including code comments and basic technical specifications, with support from senior team members. • Actively learn and grow your technical skills, seeking feedback and participating in knowledge-sharing sessions with the team. • Maintain a high level of professionalism and integrity in all interactions, representing the Experience development team and organization positively. Knowledge, Education & Experience Required • Educational background in Computer Science, Software Engineering, or related field (degree, diploma, or bootcamp certification) OR demonstrable self-taught skills with portfolio/projects • Foundational knowledge of Java and object-oriented programming concepts • Basic understanding of web development fundamentals including HTML, CSS, and JavaScript • Familiarity with version control systems (Git) • Eagerness to learn modern development frameworks and tools • Strong problem-solving abilities and willingness to ask questions • Excellent communication skills and ability to work collaboratively • Strong initiative and desire for continuous learning Bonus Skills! • Personal or academic projects demonstrating Java development • Any exposure to cloud platforms (AWS, Azure, GCP) • Familiarity with modern development tools (IntelliJ IDEA, VS Code) • Basic understanding of performance concepts or monitoring tools • Any experience with Python scripting or automation • Exposure to GitLab/GitHub workflows • Interest in or experimentation with AI development tools (Claude Code, GitHub Copilot, Cursor or similar) Why Join Northern? Equity and Diversity Northern welcomes applications from all qualified individuals and is dedicated to fostering a culture of inclusivity, employment equity, and diversity in the workplace. We encourage candidates from all backgrounds to apply, including but not limited to members of visible minorities, Indigenous peoples, individuals with diverse abilities, and those of all gender identities and expressions. We are also committed to ensuring an inclusive and accessible recruitment process. Accommodations are available at every stage of the hiring process. If you require support or adjustments to participate fully, please let us know when you apply, and we will work with you to meet your needs.",
    "via": "Job Board - Communitech",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=x-A-peofn1A8MgHyAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCQAwAYFz7CE6ZxfZE0EFH_6BDHXQv6RF61evlSKLUJ_F1xW_4iu-s2J6SyQfOrxjLm6F_Qo1vhCO9KXImgRJq7kAJxQfgBBfmPtJ8H8yy7pxTjVWvhjb4yvPoOFHHk3twp_9aDSiUIxq1681qqnLqF9CwWCBJcOBxJPEEQ4I7CyfjJVybH1alnYaaAAAA&shmds=v1_AdeF8KhWbDN5OVBB-ZJGSihazUjgPkebZbBSJfKwPV8bDCdGoA&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=x-A-peofn1A8MgHyAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "2 days ago",
      "Full-time"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsLXN0YWNrIFNvZnR3YXJlIERldmVsb3BlciBTcGVjaWFsaXN0IChQeXRob24vUHlTcGFyaykiLCJjb21wYW55X25hbWUiOiJJbnRhY3QgRmluYW5jaWFsIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IkRJajc2aEpOZkFhX3lDMlBBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Full-stack Software Developer Specialist (Python/PySpark)",
    "company_name": "Intact Financial",
    "location": "Toronto, ON",
    "description": "Our employees are at the heart of everything we do. Together, we help people, businesses, and society prosper in good times and be resilient in bad times. Our employee promise represents Intact’s commitment to you in exchange for living our Values, striving to do your best work, being open to change and investing in your career. In return, we promise to provide support, opportunities and performance-led financial rewards at a workplace where you can shape the future, win as a team and grow with us. About the role We’re looking for a Full-stack Software Developer Specialist (Python/PySpark) to join our growing team! pyska We are seeking an experienced full-stack developer with strong data engineering skills to design and deliver scalable, high-performing applications that handle large datasets and complex data workflows. The ideal candidate is language-agnostic, adaptable, and capable of picking up new technologies quickly. While the initial project will leverage Python and Databricks , the stack may evolve, so flexibility and strong engineering fundamentals are key. This role requires hands-on development, unit/integration testing, and the ability to work in a self-managed pod alongside other developers, quality engineers, and a Product Owner. Key Responsibilities: • Solution Engineering: Design and implement end-to-end application architecture for scalability, performance, and security.Build APIs, microservices, and user interfaces using modern frameworks. • Data Engineering: Develop and optimize data pipelines for large-scale datasets using Databricks, PySpark, and cloud platforms.Implement data modeling and transformation techniques to support analytics and reporting.Ensure data quality, governance, and compliance across workflows. • Hands-On Development: Write clean, maintainable code across front-end and back-end components.Integrate application logic with data pipelines and reporting layers. • Quality & Testing: Implement unit, integration, and automated tests to ensure reliability.Collaborate with QA engineers to maintain a robust control framework. • DevOps & Deployment: Apply CI/CD principles for automated builds and deployments.Ensure compliance with security and governance standards. • Collaboration: Work within a pod structure, contributing to design discussions and sprint planning.Communicate effectively with product owners and stakeholders. Qualifications: Required: • Bachelor’s or Master’s degree in Computer Science or a related field. • 10+ years of experience in full-stack development and data engineering. • Strong programming fundamentals and ability to learn new languages quickly. • Proficiency in Python required and Java a strong asset. • Experience with Databricks or similar platforms. • Familiarity with front-end frameworks (React, Angular, or similar). • Experience with cloud platforms (AWS, Azure, or GCP). • Solid understanding of CI/CD, version control (Git), and containerization (Docker/Kubernetes). • Strong problem-solving skills and ability to work independently. Preferred: • Experience with PySpark, Delta Lake, and large-scale data processing. • Exposure to data governance and security best practices. • Experience in the insurance or financial services domain. • For candidates located in Quebec, bilingualism is required considering the necessity to interact on a regular basis with English-speaking colleagues across the country. • No Canadian work experience required however must be eligible to work in Canada. #LI-Hybrid What we offer Our hybrid work model provides the balance between working from home and enjoying meaningful in-person interactions. Working here means you'll be empowered to be and do your best every day. Here is some of what you can expect as a permanent member of our team: • A financial rewards program that recognizes your success • An industry leading Employee Share Purchase Plan; we match 50% of net shares purchased • An extensive flex pension and benefits package, with access to virtual healthcare • Flexible work arrangements • Possibility to purchase up to 5 extra days off per year • An annual wellness account that promotes an active and healthy lifestyle • Access to tools and resources to support physical and mental health, embracing change and connecting with colleagues • A dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs • Inclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities • Inspiring leaders and colleagues who will lift you up and help you grow • A Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique. We are an equal opportunity employer At Intact, our Value of respect is founded on seeing diversity as a strength. We strive to create an accessible workplace where employees feel valued, included and encouraged to share their unique perspectives. We encourage applications from individuals who are members of equity-deserving groups, including but not limited to women, Indigenous peoples, persons with disabilities, Black people, and members of the 2SLGBTQI+ community. As part of Intact’s commitment to reconciliation, we acknowledge that we work, meet and travel across the land currently called Canada, originally inhabited by First Nations, Metis and Inuit people. This history extends through many centuries and continues to evolve today. We have policies to ensure equal access and participation for people with disabilities, including providing workplace adjustments (accommodations). A copy of applicable policies is available on request. If we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We’ll work with you to meet your needs. Learn more about our recruitment process and your candidate journey here. If you are an employee of Intact or belairdirect, please apply for this role on Internal Career Site.",
    "via": "Intact Careers - Intact Financial Corporation",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=DIj76hJNfAa_yC2PAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xWOsQ6CMBBA48onuHijGqHGxEVXg9FBSXAnpTmhUu-a9lT4Kz9RXN743ku-k6TIX86lUbTpoOS7fHRAOOAbHXsMUHo0VjsbBebFIC2TKobS69AtIIUz1xBRB9MCExyZG4fTfSvi406pGF3WjGaxJjP8VExYc68eXMc_qtiOLe-0YLXZrvvMU7OcnWhcEcgtafqXwRLcODAJr-B6-QHRLgViswAAAA&shmds=v1_AdeF8KgwjQaUkBhDPnG0K6_08M8v9uwlcUMS9dYr8eeexaGTOg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=DIj76hJNfAa_yC2PAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "6 days ago",
      "Full-time"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsLVN0YWNrIERldmVsb3BlciAoSmF2YSAmIEFuZ3VsYXIpIiwiY29tcGFueV9uYW1lIjoiQXJ0ZWNoIExMQyIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiJCYzB2T0psa3ZlZlNtWW5RQUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Full-Stack Developer (Java & Angular)",
    "company_name": "Artech LLC",
    "location": "Toronto, ON",
    "description": "Title:Full-Stack Developer (Java & Angular) Location: Toronto ,Ontario Duration : 6 Months We are seeking a highly skilled and motivated individual to join our dynamic team. As a Full-Stack Developer specializing in Java and Angular, you will play a crucial role in designing and building robust applications that enhance user experience and drive business success. Required Skills & Qualifications Proficiency in Java and Angular for developing scalable applications Strong understanding of JavaScript and modern JavaScript frameworks Expertise in at least one server-side language such as Java (with Spring Boot), Python (with Django or Flask), Node.js (with Express.js), PHP, or Ruby Minimum of 8 years of relevant experience Preferred Skills & Qualifications Experience with additional JavaScript frameworks such as React or Vue.js Familiarity with cloud services and deployment strategies Strong problem-solving skills and attention to detail Day-to-Day Responsibilities Develop and maintain web applications using Java and Angular Collaborate with cross-functional teams to define and implement innovative solutions Ensure the performance, quality, and responsiveness of applications Company Benefits & Culture Inclusive and diverse work environment Opportunities for professional growth and career advancement Comprehensive benefits package For immediate consideration please click APPLY to begin the screening process with Alex.",
    "via": "Jobrapido.com",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=Bc0vOJlkvefSmYnQAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7BzrdJCq2EaGLuhRFoRQddC_XcKTVmAvJtfRL_F51eeNLPpPkcO6tTe-C-gUnGsiypwCLEgeEORTO9BbDElIouYFIGHQL7ODCbCzN9q2IjzulYrSZiYLS6UzzW7Gjhkf15Cb-qWOLgbxFoXqbb8bMO7OaFkHo11XVEToHDw7shNdwu34BhndBYJkAAAA&shmds=v1_AdeF8KhAJwEfGx8-8Kw19bad55-iOkHR28Lg_88Mbn-wbynGAw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=Bc0vOJlkvefSmYnQAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "2 days ago",
      "Full-time"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsIFN0YWNrIEVuZ2luZWVyLCBMaW5rIiwiY29tcGFueV9uYW1lIjoiU3RyaXBlIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6ImY0M29sM21icWJwS1FGd2ZBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Full Stack Engineer, Link",
    "company_name": "Stripe",
    "location": "Toronto, ON",
    "description": "Who we are About The Organization Link is a digital wallet designed for effortless and secure online payments and digital transactions. With Link, consumers enjoy convenience and peace of mind: it works on any device or browser, is backed by the highest security mechanisms, offers purchase protections on eligible items, and ensures seamless and quick payments. Across the Link Engineering org, we focus on building delightful payment experiences and to allow our global consumer base to pay with their preferred payment methods. Our team’s work spans the entire stack from front-end experiences, to infrastructure that supports low-latency transactions, to intelligent systems that help protect consumers and merchants from bad actors. Team Matching: exact team matching for one of the subteams will begin during final stages. Please note we may also consider you for different orgs based on your experience, location, etc. More information on our team matching process can be found here. What you’ll do We’re looking for engineers who want to make an impact on payments at a global scale. You’ll play a key role in expanding our product suite and the infrastructure that supports it. Our team collaborates with many cross-functional teams and many other teams across Stripe to deliver innovative solutions that address evolving user needs. Responsibilities • Build and design the next generation of Stripe products, to meet the high growth needs of our company and customers for years to come. • Debug and solve critical production issues across services and multiple levels of the stack • Mentor engineers to help them grow • Collaborate with stakeholders across the company to build new features at large-scale, while improving internal engineering standards, tooling, and processes • Collaborate effectively in a distributed and hybrid team, maintaining open communication and strong connections with colleagues Who you are We're looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement. Minimum Requirements • 2-10+ years of industry software engineering experience (does not include internships nor includes co-ops) • Strong coding skills in any programming language • Strong collaboration skills, can work across workstreams within your team and contribute to your peers’ success • Have the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial • Interest in working as a generalist across varying technologies and stacks to solve problems and delight both internal and external users Preferred Qualifications • Experience with large-scale financial tracking systems • Good understanding and practical knowledge in cloud based services (e.g. gRPC, GraphQL, Docker/Kubernetes, cloud services such as AWS, etc.) In-office expectations Office-assigned Stripes in most of our locations are currently expected to spend at least 50% of the time in a given month in their local office or with users. This expectation may vary depending on role, team and location. For example, Stripes in our Bucharest, Romania site have an 80% in-office expectation, and those in Stripe Delivery Center roles in Mexico City, Mexico and Bengaluru, India work 100% from the office. Also, some teams have greater in-office attendance requirements, to appropriately support our users and workflows, which the hiring manager will discuss. This approach helps strike a balance between bringing people together for in-person collaboration and learning from each other, while supporting flexibility when possible. Pay and benefits The annual salary range for this role in the primary location is CA$135,200 - CA$202,800. This range may change if you are hired in another location. For sales roles, the range provided is the role’s On Target Earnings (“OTE”) range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and specific location. Applicants interested in this role and who are not located in the primary location may request the annual salary range for their location during the interview process. Specific benefits and details about what compensation is included in the salary range listed above will vary depending on the applicant’s location and can be discussed in more detail during the interview process. Benefits/additional compensation for this role may include: equity, company bonus or sales commissions/bonuses; retirement plans; health benefits; and wellness stipends.",
    "via": "LinkedIn",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=f43ol3mbqbpKQFwfAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFy7uzjdLDUpgovOKojoUPeShCNNG-9C7oR-gd8tvuE131XTXT45Q68uzHCmmAixtnBPNMMObuxB0NUwAhNcmWPGzWlULXK0ViSbKOo0BRP4bZnQ82In9vJvkNFVLNkpDvtDt5hCcbvutaaCkAheXJmUW3g-ft8XG0uJAAAA&shmds=v1_AdeF8KhSu8bvJnPil-2Ve2JgTVYkaDsrCLu4Rk3nE4rlJTet3A&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=f43ol3mbqbpKQFwfAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "3 days ago",
      "Full-time"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBEZXZlbG9wZXIgLSBGdWxsIFN0YWNrIiwiY29tcGFueV9uYW1lIjoiTG9ibGF3IiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6Ik5TVElnazZSOW1fUVdjY21BQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Staff Developer - Full Stack",
    "company_name": "Loblaw",
    "location": "Toronto, ON",
    "description": "At Loblaw Digital, we know that our customers expect the best from us. Whether that means building the best, most innovative online shopping experience, or designing an app that will impact the lives of people across the country, we’re up for the challenge. From our office in Downtown Toronto, we’ve created leading eCommerce experiences in the online grocery shopping, beauty, pharmacy, and apparel spaces, and we’re only just getting started. Why is this role important? You will be working on the Customer Domain team as a Full-Stack Staff developer, working on either our Authentication platform or Customer Profile Service that is used across multiple lines of business. As a Staff Developer you will be spearheading crafting of solutions to major new functionality within the platform and across the organization. You will also be mentoring members on the Software Development team, you will have exposure to every aspect of the software development cycle, and you will be encouraged to express your opinions and challenge assumptions What you'll do • Cultivate a deep understanding of the portfolio of applications we utilize, along with their respective strengths and weaknesses, to provide solutions to existing and future challenges. • Help modernize the way we work—such as making developer onboarding more seamless, helping improve automation, implementing chaos testing, etc. • Make our solutions leverage less from our third-party partners (which end to block us) and build more technology in-house. • Work across multiple stacks—BE, FE and occasionally Mobile • Lead in the design of software components to enhance our portfolio • Construct design documents and documentation to aid in maintenance and code reuse. • Through your knowledge of industry trends and tools, together with your own experiences, work with the team to improve our software, our environment, and our process. • Provide guidance and direction to the development teams to tear down obstacles and keep initiatives on target and moving forward. • Champion tech initiatives across the organization. • Translate project goals and product roadmaps into organized technical tasks. • Organize, prioritize, and manage multiple projects and multiple stakeholders simultaneously. • Provide technical guidance and support in resolving critical issues. • Offer your input and expertise to technical and non-technical audiences. • While at times, you’ll be deep diving into creating cross-team/cross-service solutions, at other times, you will be coding, doing foundational work, and helping lead/guide a team of engineers to build maintainable code using best practices Does this sound like you? • 7+ years experience • Java (required), Go, Rust • One of: React, Vue, Angular, Svelte • At least one relational or non-relational Database (MySQL, PostgreSQL, Firestore, etc) • Docker, Ansible, Ngnix, Varnish, Memcached • GCP, AWS (Elastic Beanstalk, EC2, S3) • Mobile (iOS, Android) We are hoping to find someone with as many of the following as possible: • Ability to craft a full-stack solution which involves solutioning at the FE layer, BFF/Middleware/Orchestration layer, and BE layer, and potentially across multiple stacks include Mobile & integrations with other internal teams • Solid experience building and maintaining RESTful APIs • An understanding of token-based authentication • CI/CD experience (similar experience to one of GitLab IC, GitHub Actions, Jenkins, etc.) • Ability to configure a Dockerfile for use in a build pipeline or for local development • You are opinionated about what it takes to produce great software but remain receptive to other's ideas. • You care about ownership. You proactively seek out bugs and fix them. Occasionally, when bugs find you, you don't sweep them under the rug. • You are experienced with software estimation, often confronted with complexity and uncertainty. • You make decisions based on data. You are versed with tools to measure every aspect of the application. • You have developed large applications in a team environment. • You are not afraid of changes. Armed with excellent refactoring techniques, you work effectively with legacy code. • You are a good communicator. You can present complicated solutions to non-technical audience in a simple and logical way. How You’ll Succeed: At Loblaw Digital, we seek great people to continually strengthen our culture. We believe great people model our values, are authentic, build trust and make connections. We’re able to keep innovating because our colleagues are passionate about their work and excited about the future of eCommerce. If you have big ideas, undeniable enthusiasm, and thrive in a collaborative, creative, and diverse group, we’ll get along just fine. Looking for a challenge? Good. Love an innovative work environment? Even better. Apply today. Employment Type: Full time Type of Role: Regular Loblaw Digital recognizes Canada's diversity as a source of national pride and strength. We have made it a priority to reflect our nation’s evolving diversity in the products we sell, the people we hire, and the culture we create in our organization. Accommodation is available upon request for applicants with disabilities in the recruitment and assessment process and when hired. In addition, we believe that compliance with laws is about doing the right thing. Upholding the law is part of our Code of Conduct – it reinforces what our customers and stakeholders expect of us. #EN #SS #LD #ON",
    "via": "Loblaw Careers - Loblaw Companies",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Full+Stack+Developer&htidocid=NSTIgk6R9m_QWccmAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBCAYVy7uzjdLJqI4qKrKIjooHtJwrWpnrmQO7Wv4Ftblx--v_qOqtVVXdPADt9InLHAHPYvIhh2eAw4sgdBV0IETnBgbgkn26iaZWOtCJlW1GkXTOCn5YSee3tnL__UEl3BTE6xXq4XvcmpnY5P7Ml9oEtw48JJeQaX8w9kViNBjAAAAA&shmds=v1_AdeF8KjCcGMkecWxO83_ccMK73h6POEb0rd1mzmtKioXJbXOSg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=NSTIgk6R9m_QWccmAAAAAA%3D%3D&htiq=Full+Stack+Developer",
    "extensions": [
      "20 days ago",
      "Full-time"
    ],
    "search_keyword": "Full Stack Developer",
    "scrape_date": "2025-12-04T12:06:01.947270"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnRlbmQgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVkxpbmsgSW5jIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6Ik9YbHpTMTVpaEJvaFBaeTBBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Senior Frontend Developer",
    "company_name": "VLink Inc",
    "location": "Toronto, ON",
    "description": "Hello, This is Deepak and I’m a professional Recruiter with Vlink. VLink, founded in 2006, is a leading global provider of software engineering services with next-gen technologies and best-in-class talent. Our Headquarters are in the U.S, and we have offices in 7+ countries from North America-Europe to APAC, with expansion plans in the Middle East. With over 1,000 employees working globally, VLink has helped SMBs, and large enterprises achieve their business goals, and gained the trust of Fortune-250 companies. VLink is ‘Great Place to Work® Certified™' and has been a consistent winner as- Best Places to Work in CT. Trust, collaboration, and accountability are the three elements that are at the core of VLink’s work culture. We value our professionals, providing comprehensive benefits and the opportunity for growth. Job Descriptions: Role: UI React Developer Experience: 10 Year Primary Skills: React.JS. Additional Skills: TypeScript, Node,JS Education: Bachelors Relocation: Yes Additional Information: • Working hours: 40 hours Remote/Hybrid/Onsite? Toronto, ON (Hybrid 4 days from office) About VLink: Started in 2006 and headquartered in Connecticut, VLink is one of the fastest growing digital technology services and consulting companies. Since its inception, our innovative team members have been solving the most complex business, and IT challenges of our global clients. Job Description: We are seeking a talented and motivated UI React Developer to join our dynamic team. The ideal candidate will be responsible for designing and implementing user-friendly interfaces for web applications, ensuring high performance and responsiveness to user interactions. Responsibilities: • Developing new user-facing features using React.js. • Building reusable components and front-end libraries for future use. • Translating designs and wireframes into high quality code. • Optimizing components for maximum performance across a vast array of web-capable devices and browsers. Requirements: • 10+ years of experience in front-end development, test-driven development, and architecture design principles. • Experience in React/Typescript and NodeJS. • Experience building components for design systems in delivering exceptional front-end components. • Track record of anticipating and designing solutions to overcome technical problems. • Strong ability and proven experience in building and developing a high performing team/culture, and a strong inclination for continuous learning and growth (e.g., keeping up to date on latest technology trends, industry research). • Strong communication, workshop facilitation, problem-solving/probing skills with ability to build relationships, lead teams, and actively collaborate with cross-organization. Preferred, but not required: • Familiarity with test case design at different levels (component/service, integration, end-to-end/user scenarios) or non-functional testing (Jest/Cypress). • Experience with CI/CD pipelines and automated testing frameworks.",
    "via": "LinkedIn",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=OXlzS15ihBohPZy0AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAGYFz7BOJ0s2hTBBddRVFEB8W1pPFIo_H-kAvSV_Ctpcu3ftVvUjU3loBM-wwpLE_a8ZcjEmda0gkdKdvseoLQAfCRZ9u-lKQbY1Rj7bXYElzt8DEQ7jCYFzodabW3mVO0hdvVuhnqJH4-fZyDvOkojoLQHeOKBV0vfxHkaH6MAAAA&shmds=v1_AdeF8KiQxV0_WqeX2039USKE4mEhoCl7bHC_CNGsX3EZ9jbF6A&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=OXlzS15ihBohPZy0AAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "2 days ago",
      "Full-time"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnRlbmQgRW5naW5lZXIsIEdyb3d0aCAmIEFnZW50cyBUZWFtIiwiY29tcGFueV9uYW1lIjoiRXZlblVwIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IjU2eGo3clFnRW1KRE04TkJBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Senior Frontend Engineer, Growth & Agents Team",
    "company_name": "EvenUp",
    "location": "Toronto, ON",
    "description": "EvenUp is on a mission to close the justice gap using technology and AI. We empower personal injury lawyers and victims to get the justice they deserve. Our products enable law firms to secure faster settlements, higher payouts, and better outcomes for victims injured through no fault of their own in vehicle collisions, accidents, natural disasters, and more. We are one of the fastest-growing vertical SaaS companies in history, and we are just getting started. EvenUp is backed by top VCs, including Bessemer Venture Partners, Bain Capital Ventures, SignalFire, and Lightspeed. We are looking to expand our team with talented, driven, and collaborative individuals who seek to have a lasting impact. Learn more at www.evenuplaw.com. EvenUp is seeking a Senior Frontend Software Engineer to join our Toronto team and help us build a world-class engineering organization as part of our Canadian expansion. As we grow our presence in the Toronto area, we’re looking for engineers who are passionate about user experience, performance, and building beautiful, scalable web applications. You’ll be part of a talented, collaborative team focused on delivering exceptional UI and client-side architecture for an AI-powered platform that’s redefining the future of legal services. This is a hybrid role with 3 days per week spent collaborating in our Toronto office. What You'll Do • Design and implement high-performance, accessible, and elegant user interfaces for EvenUp’s AI-driven platform • Collaborate closely with product, design, and backend teams to bring new features to life with exceptional quality and responsiveness • Contribute to frontend architecture for major product surfaces, ensuring maintainability, performance, and scalability • Develop and maintain design system components and shared libraries to streamline frontend development across teams • Optimize web applications for speed, accessibility, SEO, and responsiveness across devices and browsers • Contribute to engineering culture by mentoring peers and promoting best practices in frontend development • Play a key role in complex engineering projects from ideation to deployment in a fast-paced, startup environment What We Look For • Deep experience with modern frontend technologies like React (or similar frameworks like Vue or Svelte), TypeScript, HTML5, CSS3 (including preprocessors like Sass or styled-components), and modern build tools like Vite or Webpack • Strong understanding of state management (e.g., Redux, Zustand, Jotai) and modern frontend architecture patterns • Experience with design systems, component libraries, and UI/UX collaboration workflows using tools like Figma • Solid understanding of web performance, accessibility (a11y), and responsive design • Experience with frontend testing tools (e.g., Jest, React Testing Library, Cypress) and version control (Git) • Familiarity with frontend deployment strategies and CI/CD pipelines • Proven track record of shipping user-facing products in a fast-paced, high-growth environment • Excellent communication and collaboration skills with cross-functional teams Bonus Points • Experience working on AI-driven or data-heavy applications • Knowledge of backend integration best practices (e.g., GraphQL, REST APIs) • Familiarity with SSR frameworks (e.g., Next.js), server components, or edge rendering • Experience with cloud platforms like Vercel, Netlify, or AWS Amplify Notice to Candidates: EvenUp has been made aware of fraudulent job postings and unaffiliated third parties posing as our recruiting team – please know that we have no affiliation or connection to these situations. We only post open roles on our career page (evenuplaw.com/careers) or reputable job boards like our official LinkedIn or Indeed pages, and all official EvenUp recruitment emails will come from the domains @evenuplaw.com, @evenup.ai, @ext-evenuplaw.com, no-reply@ashbyhq.com or no‑reply@canditech.io email addresses. To ensure fairness and proper consideration, we do not accept resumes or expressions of interest via email or social media messages. If you’re interested in a role, please submit your application directly through our careers page. If you receive communication from someone you believe is impersonating EvenUp, please report it to us at talent-ops-team@evenuplaw.com. Examples of fraudulent domains include “careers-evenuplaw.com” and “careers-evenuplaws.com”. Benefits & Perks: As part of our total rewards package, we offer attractive benefits and perks to our employees, including: • Choice of medical, dental, and vision insurance plans for you and your family • Additional insurance coverage options for life, accident, or critical illness • Flexible paid time off, sick leave, short-term and long-term disability • 10 US observed holidays, and Canadian statutory holidays by province • A home office stipend • 401(k) for US-based employees and RRSP for Canada-based employees • Paid parental leave • A local in-person meet-up program • Hubs in San Francisco and Toronto Please note the above benefits & perks are for full-time employees EvenUp is an equal opportunity employer. We are committed to diversity and inclusion in our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Compensation Range: CA$99.8K - CA$215K",
    "via": "LinkedIn",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=56xj7rQgEmJDM8NBAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXOoQ7CMBAA0GDnMahTCDJWQoIBhShLECAYeunGpS3Z7preBfYv_CyZefoVv0VhH0iRM1wykyK9wJKPhJhLqDN_NcAazh5JBRp0I2zhyh0IutwHYIKa2Q-4OgXVJEdjRIbKizqNfdXzaJiw48m8uZOZVoLLmAan2O4Pu6lK5DdL-0F6JogEDc8PLuF--wPwu71YngAAAA&shmds=v1_AdeF8KjpsEbonHMQ1pkMZGpf1RAf6QMmKHlWNR32fEv-bvpRxA&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=56xj7rQgEmJDM8NBAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "2 days ago",
      "$99,789–$215,000 a year",
      "Full-time"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGcm9udGVuZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJNb3Rpb24gUmVjcnVpdG1lbnQiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoiWUxZMGRTbThILWUza052NkFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Frontend Developer",
    "company_name": "Motion Recruitment",
    "location": "Toronto, ON",
    "description": "Senior Frontend Engineering Contract Downtown Toronto! Job Description We are seeking a Senior Frontend Developer to join an innovative technology team. You’ll develop engaging and accessible web applications using React, Next.js, and TypeScript. This is a 6-12 month contract to start with potential extension, requiring a hybrid structure (2 days in office downtown Toronto), offering a competitive hourly rate. This role is ideal for a proactive front-end developer who enjoys creating polished, consumer-facing web applications and thrives in collaborative, fast-paced environments. You will get the opportunity to make a meaningful impact on digital experiences in the retail media space delivering high profile projects. This role requires an understanding of React at a Senior level. Required Skills & Experience • Strong hands-on experience in React • Proficient in JavaScript (ES6+), HTML5, CSS3. • Experience in building responsive layouts across devices. • Proficiency with Git version control, including pull requests, branching, and code reviews. • Strong knowledge of consuming and integrating with REST APIs. • Thorough understanding of UX/UI principles, with a focus on modern browser technologies and consumer-facing products. • Collaborative mindset and experience working in Agile teams. Desired Skills & Experience • Additional experience with Vue.js or Angular. • Working knowledge of GraphQL for data fetching. • Experience using Redux for state management. • Experience with Next.js for server-side rendering. • Familiarity with Node.js. • Knowledge of Babel for JavaScript transpiration. • Experience with Highcharts or other data visualization libraries. • Experience in enterprise grade projects If interested in learning more about this opportunity, please submit your resume and I’ll reach out to further discuss! Applicants must be currently authorized to work in Canada on a full time basis now and in the future.",
    "via": "Motion Recruitment",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=YLY0dSm8H-e3kNv6AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNMQoCMRBAUWz3CFZjqWgigo22oiCoIPZLEodsJDsTMqPsHby0bvPL95vvpJkfK5MiPeGAH8xcsMIKzuxB0NXQAROcmGPG6b5TLbKzViSbKOo0BRO4t0zoebAv9jKmlc5VLNkptpvtejCF4mJ2YU1_646hvpP2SAqJ4MHjnpdwu_4AWK8NPI4AAAA&shmds=v1_AdeF8KhJNltjYz3mumyemdrAFRBacaG0zylrh3UMQ562cgscXw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=YLY0dSm8H-e3kNv6AAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "US$60–US$75 an hour",
      "Contractor"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGcm9udGVuZCBEZXZlbG9wZXIgMyAtIEFuZ3VsYXIiLCJjb21wYW55X25hbWUiOiJCZWhhdm94IiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IlktOU1IbWp2MTQzM2NjTC1BQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Frontend Developer 3 - Angular",
    "company_name": "Behavox",
    "location": "Toronto, ON",
    "description": "About Behavox Behavox is shaping the future for how businesses harness their most important raw material - data. Our mission is bold: Organize enterprise data into actionable information that protects and promotes the business growth of multinational companies around the world. From managing enterprise risk and compliance to maximizing revenue and value, our data operating platform presents a widespread opportunity to build multilingual, AI/ML-based solutions that activate data for every function within a global enterprise. Our approach is unique, and it's validated by our customers who tell us to keep forging ahead because no one else is aggregating, analyzing, and acting on data to uncover opportunities or solve problems quite the way we are. We are looking for fearless innovators who have an insatiable appetite for building what no one has built before. About the Role Behavox is an ecosystem of products with the common mission to organize all corporate communications and productivity data on Earth, and to make it useful to human organizations around the globe to become more compliant, improve conduct & culture, automate their CRM functions and more. We use behavioral signals captured in internal data to help businesses achieve better outcomes by linking employee behavior to specific business processes, which helps organizations understand how they can unleash the collective power of their people. The Engineering division which is part of the Technology department is responsible for architecting systems capable of ingesting, processing large volumes of data, analyzing the data using properietary AI models, generating high-quality insights and developing workflows that surface these insights to key personas effectively. As a Frontend Engineer 3, you will be a part of an engineering team responsible for one of our products. You will partner up with the product management, design and other engineering teams to solve complex technical problems and deliver outstanding products to our clients, on time. We value candidates who are motivated by solving intricate engineering problems and are experienced in building and managing large-scale web applications. Expertise in JavaScript, particularly with frameworks like Angular, is essential. You should be passionate about taking comprehensive design and ownership responsibilities throughout the entire software development lifecycle (SDLC). Note that a lack of experience in some of the specific technologies is not a barrier as we highly value the ability to learn and adapt. For the right Talent this is a great opportunity because: 1. We are not a startup, nor an enterprise - so this is the best time to join as your contribution will be highly visible and impactful. 2. Engineering is an equal contributor to the company goals. Success in this area is vital, along with the other business functions. 3. We have small dynamic feature teams with short development cycles and dedicated releases in which you can promote your ideas from day one. We love competition. What You'll Bring • A deep and genuine interest in Behavox as demonstrated by a connection to its mission, marketplace and/or technologies • 5+ years of experience building scalable and reliable web applications with complex UI (single page application development) • Strong knowledge of frontend web technologies and JavaScript frameworks, TypeScript, Angular or other strongly-typed languages • Experience working in a product-oriented team and a thorough understanding of the software development life cycle • Deep understanding of reactive programming concepts and their practical applications in building dynamic and responsive user interfaces What You'll Do • Create frontend for scalable and reliable web applications with complex UI using JS frameworks (Angular) and TypeScript language • Contribute to the analysis of product requirements to facilitate solution discussions and decisions that shape the implementation plan • Work collaboratively during planning sessions, technical discussions, status meetings, and code reviews to ensure alignment and quality • Take ownership of the assigned features and tasks, demonstrating autonomy and a capacity to learn and adapt quickly • Be responsible for software quality by writing tests at all levels of the testing pyramid, including unit, integration, component, and contract testing, to enhance overall product integrity What We Offer • A truly global mission with a passionate community in locations all over the world • Huge impact and learning potential as our aspirations require bold innovation • Highly competitive compensation with 100% bonus pay already integrated • Benefits include great health coverage for employee and family • Generous time-off policy and flexible work schedule About Our Process We take Talent very seriously and we are building a community of extraordinary individuals working together in very high performing teams. We also know that the best Talent always has options so we believe that the process has to be a two way assessment - the company AND the candidate assessing the business needs alignment, the career next step alignment, and the cultural alignment. During the process we will begin by exploring the core factors regarding salary and location along with core experience and skills and values alignment. We will then deep dive explore the critical technical competencies we have identified for the role, and then we will deep dive in behavioral competencies. The most aligned candidate will then be asked to do a practical work task simulation activity so we can make sure that you will enjoy the kind of work the role requires, and this task will typically be presented and discussed with a group of colleagues and managers.",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=Y-9MHmjv1433ccL-AAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBRGYVz7AA5OdxZtROliJ0UUHHRxL2m9JJV4_5AbSx_Ch9Yuh287xXdWVOcEySxPOvHAAZET7WhNB3GfYNNfV7SkbFPnCUIXwAVe1D7nqHtjVEPpNNvcd2WHt4Fwi9G80OqURr1NHIPN3GyrzVhGccv5kb0dMFIv9MD0x4rutx-YOoNnjwAAAA&shmds=v1_AdeF8KivfQaqZUixF1OQLq36qR1Ff6w3zOSEdMDObGLvwucyGg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=Y-9MHmjv1433ccL-AAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "6 days ago",
      "Full-time"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnRlbmQgRGV2ZWxvcGVyIOKAkyBNaWNybyBGcm9udGVuZCBQbGF0Zm9ybSIsImNvbXBhbnlfbmFtZSI6Ik4yUCBTeXN0ZW1zIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IlhGQW1XZkk5Vml0X1RnNkdBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Senior Frontend Developer – Micro Frontend Platform",
    "company_name": "N2P Systems",
    "location": "Toronto, ON",
    "description": "Job Description: We are seeking a Senior Frontend Developer to lead the architecture and evolution of our micro frontend platform for Bell.ca. The ideal candidate will have deep expertise in building modern frontend applications at scale and a strong background in micro frontend architectures. You will define standards, provide technical guidance, and collaborate with cross-functional teams to ensure a consistent and performant user experience. Responsibilities: • Lead the architecture and development of the micro frontend platform, enabling domain-based feature teams to deliver independently. • Define standards for shell app coordination, shared libraries, routing, and runtime integrations. • Design and implement shared state management, version control, and safe rollout mechanisms for micro frontends. • Provide technical guidance and mentorship to senior frontend engineers. • Collaborate with Platform teams to ensure seamless CI/CD pipelines and observability. • Work with Product, Design, and Content teams to maintain a consistent user experience. • Represent frontend technical leadership across cross-functional projects. • Navigate trade-offs between centralized control and team autonomy. Qualifications: • 8–10 years of experience building modern frontend applications at scale. • Deep expertise with React frameworks such as Next.js and Remix, and micro frontend tooling. • Strong understanding of performance optimization, security, accessibility, and responsive design. • Experience with distributed monorepo or federated repo setups. • Excellent communication skills and ability to influence both technical and non-technical stakeholders. • Good to have: familiarity with Turboprop, backend-for-frontend (BFF) layers, GraphQL APIs, edge functions, and contributions to platform-level SDKs or component frameworks. Job Type: Fixed term contract Pay: $55.00 per hour Experience: • Modern Frontend Development (React, Next.js, Remix): 8 years (required) • Performance, Security, Accessibility, Responsive Design: 8 years (required) • Micro Frontend Architecture: 5 years (required) • State Management & Version Control: 5 years (required)",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=XFAmWfI9Vit_Tg6GAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_0WNMQrCQBAAsc0TUm0tmpOAjbaiIBoDsQ-Xc01OLrfH7SKx8w8-wn_5Ek1lM83ATPKeJIcKvaUI20he0F9gg3d0FDDC5_mCozWR_rJ0Wq4Ue5jDnhpg1NF0QB52RK3DdN2JBF4pxeyylkWLNZmhXpHHhgZ1o4ZH1NzpiOFXwzpfLoYs-HaaFnkJ1YMFewbr4UzjlmZwKr7F2CzlqgAAAA&shmds=v1_AdeF8KiE1Dn1kMnMRLMbxL7YxDW7D6H2yB1nsdNSrABBDcVxOw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=XFAmWfI9Vit_Tg6GAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "6 days ago",
      "Contractor"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgRnJvbnQgRW5kIERldmVsb3BlciAtIFRoaW5raW5nYm94IiwiY29tcGFueV9uYW1lIjoiVGhpbmtpbmdib3giLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoicXExRWdfLWRFcjJndFNFTkFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Junior Front End Developer - Thinkingbox",
    "company_name": "Thinkingbox",
    "location": "Toronto, ON",
    "description": "Who We Are Hi! We’re Thinkingbox, a brand experience agency driven by craft and curiosity. Our team blends diverse perspectives in design, technology, and strategy to push boundaries and deliver innovative work for our clients. We’re a curious group that loves to think big, keep learning, and create meaningful experiences. Culture is at the heart of who we are, and our offices are hubs of natural collaboration. From hanging out with our office dogs to enjoying Thursday happy hours, we keep our work environment vibrant, welcoming, and fun. Each year, we also encourage our people to spend a month exploring the world, whether that means working from another office or even from the beaches of Mexico, to expand their perspectives and bring fresh inspiration back to the team. The Opportunity We are seeking a talented and motivated Junior Front End Developer to join our team for a 3 month contract with potential to convert to full-time. As a Junior Front End Developer at Thinkingbox, you will have the opportunity to work alongside experienced Developers in a collaborative environment. This internship offers hands-on experience in developing interactive web applications and immersive digital experiences for our diverse range of clients. What You'll Be Doing • Collaborate with designers and developers to translate creative concepts into engaging user experiences • Develop responsive and visually appealing front end interfaces using HTML, CSS, and JavaScript • Optimize web applications for maximum speed and scalability • Conduct thorough testing and debugging to ensure cross-browser compatibility and seamless functionality • Stay updated on emerging trends and technologies in front end development to enhance project outcomes • Assist in the maintenance and updates of existing websites and applications • Contribute ideas and solutions to enhance user experience and overall project quality What You'll Bring • Bachelor's or Master's degree program in Computer Science, Web Development, or related field • Proficiency in HTML, CSS, and JavaScript • Familiarity with front end frameworks such as React, or Vue.js is a plus • Basic understanding of design principles and UI/UX best practices • Strong problem-solving skills and attention to detail • Excellent communication and teamwork abilities • Ability to thrive in a fast-paced environment and manage multiple tasks simultaneously Equal Opportunity At Thinkingbox, we’re committed to creating an inclusive environment where everyone feels valued, heard, and empowered to thrive. We believe that diversity is our creative strength – it's the range of perspectives, experiences, and backgrounds that fuels our best ideas and most innovative solutions. We welcome and encourage applicants of all races, ethnicities, genders, identities, abilities, ages, sexual orientations, and backgrounds to apply. Your voice matters here. To Apply Thank you for your interest in joining our team. Please submit your resume along with links to your online portfolio as part of your application (if applicable). Due to the volume of applications we receive, we’re unable to respond to every submission. However, all applications are kept in our talent database and will be considered for future opportunities. We may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us. Placement in the salary range will be based on factors such as internal equity, candidate experience, skills, and qualifications relevant to the role.",
    "via": "LinkedIn",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=qq1Eg_-dEr2gtSENAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_02OOw7CMBAFRZsjpNoagY2QaKCg4SOlgCZ9ZIeV7WB2La9BOQunJelonjTFaF71XVTH5k2BM1wyU4EzPeCEH4ycMMMaWh_oGchZHidq2IKgyb0HJrgyu4j1wZeSZK-1SFROiimhVz2_NBNOmh7YyjydeJMxRVOw2-42o0rklvV_IBC0PN_gFdxvP-RE6XmdAAAA&shmds=v1_AdeF8KjbTX9BKMG9Mvp14IR_x77r_0ZoIUs8Rv0XQQ40eCoTiQ&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=qq1Eg_-dEr2gtSENAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "5 days ago",
      "$45K–$55K a year",
      "Full-time"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJGcm9udC1FbmQgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiUmFuZHN0YWQgQ2FuYWRhIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04iLCJodGlkb2NpZCI6IjBPc0VSVGwzOFFWY3Jfd0RBQUFBQUE9PSIsImhsIjoiZW4ifQ==",
    "title": "Front-End Developer",
    "company_name": "Randstad Canada",
    "location": "Toronto, ON",
    "description": "Are you a Front-End Developer looking for a new opportunity? Are you looking for a new contract opportunity? We are pleased to offer you a new contract opportunity for you to consider: Front-End Developer -Start: ASAP -Estimated length: 6 months -Location: Toronto -Hybrid role Actively seeking for candidates with below requirements. Advantages You will have an opportunity to work with a leading employer in the local market. Responsibilities -Sustainment and enhancements for the Vacant Home Tax application. -Perform upgrades on the Tax Relief application – an application used by low income citizens to get tax rebates. -Development and deployment of revenue services custom service and staff facing tool to help revenue service customer service team triage and assign questions from citizens to different units in the division. -Implement enhancements for the eBilling other applications that perform look up against the revenue databases. Qualifications 1. Post-secondary education in Computer Science or a related discipline with extensive development / sustainment experience in large-scale IT solutions, or the approved equivalent combination of education and/or experience. 2. Extensive experience in business system analysis, rapid application development and programming in a large, diverse computing environment. 3. Extensive experience in HTML5, CSS3, JavaScript, JQuery, React and Bootstrap. 4.Extensive experience in using REST APIs, including JSON and XML APIs. 5.Experience developing digital products that comply with accessibility standards and/or best practices (WCAG 2.x AA, AODA, WAI-ARIA). 6.Experience optimizing for the accessibility features of the platform (HTML, iOS, Android). 7.Experience developing and/or maintaining large scale information technology applications. 8.Ability to effectively communicate with team members and clients regarding technical and business requirements. Strong inter-personal skills with the ability to work effectively as a member of a team, collaboratively with others in multidisciplinary team environment and work independently, as required. 9.Ability to effectively work independently with minimal supervision 10. Proactively investigates and participates in root cause analysis during unanticipated outages by providing debugging support Summary Do you have this experience? If you answer YES, then please apply IMMEDIATELY to so we can then discuss your experience and interest in this opportunity! Randstad Technologies Group Canada's largest provider of IT Staffing Solutions, offering hundreds of permanent and contract opportunities across all roles, levels and platforms. Our Web-based tools help you see and apply for jobs matched automatically to your skills and preferences. When you're ready to interview we meet with you in person to help you build the technology career path you've always wanted. Visit www.randstad.ca to get started! Randstad Canada is committed to fostering a workforce reflective of all peoples of Canada. As a result, we are committed to developing and implementing strategies to increase the equity, diversity and inclusion within the workplace by examining our internal policies, practices, and systems throughout the entire lifecycle of our workforce, including its recruitment, retention and advancement for all employees. In addition to our deep commitment to respecting human rights, we are dedicated to positive actions to affect change to ensure everyone has full participation in the workforce free from any barriers, systemic or otherwise, especially equity-seeking groups who are usually underrepresented in Canada's workforce, including those who identify as women or non-binary/gender non-conforming; Indigenous or Aboriginal Peoples; persons with disabilities (visible or invisible) and; members of visible minorities, racialized groups and the LGBTQ2+ community. Randstad Canada is committed to creating and maintaining an inclusive and accessible workplace for all its candidates and employees by supporting their accessibility and accommodation needs throughout the employment lifecycle. We ask that all job applications please identify any accommodation requirements by sending an email to accessibility@randstad.ca to ensure their ability to fully participate in the interview process.",
    "via": "Randstad",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=0OsERTl38QVcr_wDAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNvwrCMBCAcVz7CA5yc7GJCC461j_goCDu5dIcTSXehVyQvoJvrV2-7cdXfRdVfc7CpTmxhyN9KEqiDA1cxYES5j6AMFxEhkjLQygl6d5a1WgGLVjG3vTytsLkZLIvcTqn04CZUsRC3Xa3mUzioV49kP3feGiR0SOMDE-Z57KG--0H01IaN4wAAAA&shmds=v1_AdeF8Khz4I_i7DXaoj6Lc29tWv8Lp1a6FrEY8GztcKfmbC4zLw&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=0OsERTl38QVcr_wDAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "27 days ago",
      "Contractor"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnQgRW5kIC0gU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQUtLT0RJUyIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OIiwiaHRpZG9jaWQiOiI4b0w1WUZpNlFEb0x5dUlLQUFBQUFBPT0iLCJobCI6ImVuIn0=",
    "title": "Senior Front End - Software Developer",
    "company_name": "AKKODIS",
    "location": "Toronto, ON",
    "description": "Term: January 05, 2025- March 31, 2026 Location: Onsite Street, Toronto, ON Our client is seeking a Senior Front End - Software Developer Key Deliverable for Senior Front End - Software Developer: Product Requirements: Collaborate with stakeholders to translate technical specifications into functional designs. Gather and document requirements for responsive, cross-browser compatible interfaces, ensuring alignment with user experience goals and accessibility standards (AODA). Product Delivery: Develop and implement front-end code using modern frameworks and design patterns. Create interactive, visually appealing interfaces and maintain unit tests to ensure quality. Provide post-implementation support, troubleshoot issues, and optimize performance across platforms. Prioritization: Manage multiple development tasks, focusing on critical features and timelines. Apply structured methodologies and best practices to deliver scalable, maintainable solutions. Ensure compliance with security, usability, and interoperability standards while meeting project milestones. Collaboration: Work closely with designers, back-end developers, and business teams throughout the software development lifecycle. Participate in design walkthroughs, beta programs, and vendor assessments. Communicate progress, risks, and recommendations effectively to stakeholders. Must haves: • 7+ years of web development experience with HTML5, CSS3, SCSS/SASS, JavaScript, AJAX and jQuery • 5+ years of hands-on development in C#/ASP.NET including .NET Core • 3+ years of experience developing applications in script-based MV* front-end frameworks like Angular (or React) with TypeScript and component libraries • Experience working with REST APIs, SQL, and non-relational databases such as Cosmos DB • Experience with Git and knowledge of source control strategies • Knowledge of WCAG standards and techniques, including WAI-ARIA and OWASP security principles/best practices • Solid communications skills: the ability to understand (comprehension) and follow instructions and requirements to communicate clearly and effectively both verbally and in writing.",
    "via": "Akkodis",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=8oL5YFi6QDoLyuIKAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xWNMQrCQBAAsc0DLKy2Fs2JYKM2QlQ0YIrYh0tcc5Fz97hdNP_wwybNFFPMJL9Jsi-ROo5wikwKR3rAEkp-6tdGhAw_6DlgHOSVaxC0sXHABGfm1uNs51SDbI0R8WkrarVr0obfhglr7s2LaxlRiRt6wVvFar1Z9Wmgdj495HmRXUroCO48_nkBxe0PClTvxpYAAAA&shmds=v1_AdeF8Kg3SVJOXxUm8kSJWr1J0SryTLI6-jdm0vC0yE9-r4Ybdg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=8oL5YFi6QDoLyuIKAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "3 days ago",
      "Contractor"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnQtRW5kIEVuZ2luZWVyIGZvciBFbnRlcnByaXNlIFdlYiBBcHBzIiwiY29tcGFueV9uYW1lIjoiUyBNIFNvZnR3YXJlIFNvbHV0aW9ucyBJbmMiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoiZWlYaExRNVU0V0FmYmlDUUFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Senior Front-End Engineer for Enterprise Web Apps",
    "company_name": "S M Software Solutions Inc",
    "location": "Toronto, ON",
    "description": "A software solutions company is seeking a Senior Front End Software Developer to translate technical specifications into working applications. The ideal candidate will have over 10 years of experience with Java Enterprise technologies and proficiency in modern frameworks such as React and Angular. This role offers the opportunity to contribute to complex enterprise applications and work on a variety of technologies in a collaborative environment located in Toronto. #J-18808-Ljbffr",
    "via": "Talent.com",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=eiXhLQ5U4WAfbiCQAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xWOuwrCQBBFsc0nWE2rmKwINlpZxBeoRQTLkKyTzUqcWXZGzHf5hSbN5XBOc5PfJDkWSJ4j7COTpjk9ISfnCTFCM-icFGOIXhAeWMMuBIEUzlyDYBVtC0xwYHYdTretapCNMSJd5kQr9Taz_DZMWHNvXlzLOKW0VcTQVYrlar3ss0BuPivgAgU3-h3aAN1HPZPAiSx4gjuP93gBt-sfQqyAlrUAAAA&shmds=v1_AdeF8KjFKdt3t-AhiH2-Qm_-TlZRULEgni9X6_IrkbNHB6pjeQ&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=eiXhLQ5U4WAfbiCQAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "4 days ago",
      "Full-time"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  },
  {
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRnJvbnQtRW5kIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlZpYWZvdXJhIEluYy4iLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiIsImh0aWRvY2lkIjoiT0ZlQ0ExX3NlNzZPdTZIcEFBQUFBQT09IiwiaGwiOiJlbiJ9",
    "title": "Senior Front-End Developer",
    "company_name": "Viafoura Inc.",
    "location": "Toronto, ON",
    "description": "Senior Front-End Developer Company: Viafoura Location: Toronto/Remote Employment Type: Full-time About Viafoura Viafoura is a digital experience company that helps brands activate their digital audiences. We partner with over 800 global media brands to increase on-site engagement and personalization, drive new user registrations and conversions and generate valuable first-party data. Our digital experience platform is accessed by nearly 1 billion monthly users and is deeply integrated into our customers’ CMS, identity management, and DMPs/CDPs to provide a seamless user experience. About the Role We are looking for a talented Senior Front-End Developer to join our engineering team and help build exceptional user experiences. You'll take ownership of complex UI components, collaborate with designers and product teams, and mentor other developers while contributing to our front-end architecture and development standards. Key Responsibilities Development & Implementation • Build responsive, accessible web applications using modern JavaScript frameworks (Vue.js preferred) • Develop reusable component libraries and design systems that scale across multiple products • Implement pixel-perfect designs while ensuring cross-browser compatibility and mobile responsiveness • Optimize application performance through code splitting, lazy loading, and efficient state management Technical Leadership • Lead front-end architecture decisions and establish coding standards and best practices • Conduct code reviews and provide constructive feedback to team members • Mentor junior and intermediate developers, helping them grow their technical skills • Collaborate with backend engineers to design and consume APIs effectively User Experience & Quality • Work closely with UX/UI designers to translate mockups and prototypes into functional interfaces • Implement comprehensive testing strategies including unit tests, integration tests, and end-to-end testing • Ensure accessibility compliance (WCAG guidelines) and optimize for performance across devices Process & Collaboration • Contribute to sprint planning, estimation, and technical requirement gathering • Stay current with front-end trends and evaluate new tools and frameworks for potential adoption • Document technical decisions and maintain clear communication with stakeholders Required Qualifications • Bachelor's degree in Computer Science, Web Development, or related field, or equivalent experience • 5+ years of professional front-end development experience • Expert-level proficiency in JavaScript (ES6+), HTML5, CSS3/SCSS and TypeScript • Strong experience with at least one modern JavaScript framework (Vue3 preferred) • Proficiency with build tools and bundlers (Webpack, Vite, or similar) (Vite preferred) • Experience with version control systems (Git) and collaborative development workflows • Knowledge of testing frameworks (Jest, Cypress, Testing Library) • Understanding of web performance optimization techniques and browser developer tools Preferred Qualifications • Familiarity with state management libraries (Redux, Zustand, Pinia) • Knowledge of CSS-in-JS solutions or modern CSS frameworks (Tailwind CSS) • Experience with CI/CD pipelines and deployment processes • Background in progressive web apps (PWAs) and service workers • Understanding of SEO principles and server-side rendering (Next.js, Nuxt.js) • Experience with design tools (Figma) and design system implementation • Knowledge of web security best practices Technical Skills Core Technologies: JavaScript, TypeScript, React/Vue/Angular, HTML5, CSS3 Tools & Frameworks: VUE3, Pinia, Webpack, Vite, Jest, Cypress, Storybook, Figma Additional: RESTful APIs, Git, Agile methodologies, responsive design What We Offer • Competitive salary with opportunity for performance-based compensation • Latest hardware and development tools • Flexible working hours and remote work options • Collaborative culture with regular team events and learning sessions",
    "via": "Viafoura Job Board",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Frontend+Developer&htidocid=OFeCA1_se76Ou6HpAAAAAA%3D%3D&hl=en-CA&shndl=37&shmd=H4sIAAAAAAAA_xXNvQrCMBQGUFz7COJwZ7GJCi66-oMOOiiuJY3XJhLvF5IofQqfWbqc9VS_UbW4sngk2idIqXfyoC1_OSByoppOaCmzSdYRhA5AF3i8caXEvNY656C6XEzxVlm8NYRb9PqFNg802ZnEMZjCzXI171WUbjq5e_PEJxk6ilXkhW4Yaszocv4DQ8vE9ZEAAAA&shmds=v1_AdeF8KjKJB0Q19NiL3yVPg-O67GYKzL3-_YPA_IOKlklaA0Qgg&shem=damc&source=sh/x/job/uv/m5/1#fpstate=tldetail&htivrt=jobs&htidocid=OFeCA1_se76Ou6HpAAAAAA%3D%3D&htiq=Frontend+Developer",
    "extensions": [
      "Full-time"
    ],
    "search_keyword": "Frontend Developer",
    "scrape_date": "2025-12-04T12:05:56.153651"
  }
]